{
  "id": "d4a2e7c1-8b3f-4d9e-a1c6-5f8e2d7b3a90",
  "name": "Limbo - Power of the Mind",
  "slug": "limbo-power-of-the-mind",
  "category": "EnvironmentRule",
  "subcategory": "Planar Rules",
  "tags": [
    "Limbo",
    "Outer Planes",
    "Chaotic Neutral",
    "Intelligence Check",
    "Magic Action",
    "Planar Feature",
    "Telekinesis",
    "Transmutation",
    "Stabilization"
  ],
  "source": {
    "book": "Dungeon Master's Guide",
    "chapter": "Chapter 6: Cosmology",
    "section": "Limbo - Power of the Mind"
  },
  "gameEdition": "2024",
  "description": "Limbo conforms to the will of the creatures inhabiting it. Creative imaginations can create whole islands of their own invention within the plane, sometimes maintaining those places for years. A nonsapient creature such as a fish, though, might have less than a minute before the pocket of water surrounding it freezes, vanishes, or turns to glass. Slaadi live here and swim amid this chaos, creating nothing, whereas githzerai build entire monasteries with their minds. As a Magic action, a creature in Limbo can make an Intelligence check to mentally move an object within 30 feet of itself that is on the plane and isn't being worn or carried. The DC depends on the object's size: DC 5 for Tiny, DC 10 for Small, DC 15 for Medium, DC 20 for Large, and DC 25 for Huge or larger. On a successful check, the creature moves the object 5 feet plus a number of feet equal to how much the total exceeded the DC. A creature can also take a Magic action to make an Intelligence check to alter a nonmagical object within 30 feet of itself that isn't being worn or carried. The DC is based on the object's size: DC 10 for Tiny, DC 15 for Small, DC 20 for Medium, and DC 25 for Large or larger. On a successful check, the creature changes the object into another nonliving form of the same size, such as turning a boulder into a ball of fire. Finally, a creature in Limbo can take a Magic action to make a DC 20 Intelligence check to stabilize an area within a 30-foot-radius Sphere centered on a point it can see on the plane. On a successful check, the creature prevents the area from being altered by the plane for 24 hours or until the creature takes this Magic action again.",
  "shortDescription": "On Limbo, creatures can use Magic actions and Intelligence checks to mentally move objects, alter nonmagical objects, or stabilize areas against the plane's chaos.",
  "flavorText": "Limbo is a plane of pure chaos, a roiling soup of impermanent matter and energy. Stone melts into water that freezes into metal, then turns into diamond that burns up into smoke that becomes snow, and on and on in an endless, unpredictable process of change.",
  "rulesAsWritten": "As a Magic action, a creature in Limbo can make an Intelligence check to mentally move an object within 30 feet of itself that is on the plane and isn't being worn or carried. The DC depends on the object's size: DC 5 for Tiny, DC 10 for Small, DC 15 for Medium, DC 20 for Large, and DC 25 for Huge or larger. On a successful check, the creature moves the object 5 feet plus a number of feet equal to how much the total exceeded the DC. A creature can also take a Magic action to make an Intelligence check to alter a nonmagical object within 30 feet of itself that isn't being worn or carried. The DC is based on the object's size: DC 10 for Tiny, DC 15 for Small, DC 20 for Medium, and DC 25 for Large or larger. On a successful check, the creature changes the object into another nonliving form of the same size, such as turning a boulder into a ball of fire. Finally, a creature in Limbo can take a Magic action to make a DC 20 Intelligence check to stabilize an area within a 30-foot-radius Sphere centered on a point it can see on the plane. On a successful check, the creature prevents the area from being altered by the plane for 24 hours or until the creature takes this Magic action again.",
  "isVariantRule": false,
  "isOptionalRule": false,
  "replacesRule": null,
  "prerequisiteRules": [],
  "incompatibleWith": [],
  "hasLevels": false,
  "levelStackingBehavior": "NotApplicable",
  "numericalModifiers": [],
  "advantageGrants": [],
  "disadvantageImposes": [],
  "automaticOutcomes": [],
  "actionRestrictions": [],
  "conditionsImposed": [],
  "immunities": [],
  "resistances": [],
  "vulnerabilities": [],
  "relatedConditions": [],
  "applicationLogic": [
    {
      "id": "a1b2c3d4-1111-4aaa-b111-000000000001",
      "order": 0,
      "name": "Mentally Move Object",
      "description": "As a Magic action, a creature in Limbo can make an Intelligence check to mentally move an object within 30 feet of itself that is on the plane and isn't being worn or carried. The DC depends on the object's size: DC 5 for Tiny, DC 10 for Small, DC 15 for Medium, DC 20 for Large, and DC 25 for Huge or larger. On a successful check, the creature moves the object 5 feet plus a number of feet equal to how much the total exceeded the DC.",
      "trigger": {
        "event": "OnAbilityCheckMade",
        "condition": "Creature is in Limbo and uses a Magic action to attempt to mentally move an object within 30 feet that is on the plane and isn't being worn or carried",
        "scope": {
          "abilityScores": ["INT"],
          "customScope": "Object must be within 30 feet, on the plane, and not being worn or carried"
        }
      },
      "effects": [
        {
          "effectType": "CustomEffect",
          "description": "On a successful Intelligence check, the creature moves the object 5 feet plus a number of feet equal to how much the check total exceeded the DC. DCs by object size: Tiny DC 5, Small DC 10, Medium DC 15, Large DC 20, Huge or larger DC 25.",
          "mechanicalNote": "Movement distance = 5 + (check total - DC) feet on success. Requires a Magic action. DC 5 (Tiny), DC 10 (Small), DC 15 (Medium), DC 20 (Large), DC 25 (Huge or larger)."
        }
      ],
      "appliesToSelf": false,
      "appliesToTarget": true,
      "appliesToArea": false,
      "isOptional": true,
      "requiresDMApproval": false
    },
    {
      "id": "a1b2c3d4-2222-4bbb-b222-000000000002",
      "order": 1,
      "name": "Alter Nonmagical Object",
      "description": "A creature can take a Magic action to make an Intelligence check to alter a nonmagical object within 30 feet of itself that isn't being worn or carried. The DC is based on the object's size: DC 10 for Tiny, DC 15 for Small, DC 20 for Medium, and DC 25 for Large or larger. On a successful check, the creature changes the object into another nonliving form of the same size, such as turning a boulder into a ball of fire.",
      "trigger": {
        "event": "OnAbilityCheckMade",
        "condition": "Creature is in Limbo and uses a Magic action to attempt to alter a nonmagical object within 30 feet that isn't being worn or carried",
        "scope": {
          "abilityScores": ["INT"],
          "customScope": "Object must be nonmagical, within 30 feet, and not being worn or carried"
        }
      },
      "effects": [
        {
          "effectType": "CustomEffect",
          "description": "On a successful Intelligence check, the creature changes the nonmagical object into another nonliving form of the same size. DCs by object size: Tiny DC 10, Small DC 15, Medium DC 20, Large or larger DC 25.",
          "mechanicalNote": "Transforms a nonmagical object into another nonliving form of the same size. Requires a Magic action. DC 10 (Tiny), DC 15 (Small), DC 20 (Medium), DC 25 (Large or larger)."
        }
      ],
      "appliesToSelf": false,
      "appliesToTarget": true,
      "appliesToArea": false,
      "isOptional": true,
      "requiresDMApproval": false
    },
    {
      "id": "a1b2c3d4-3333-4ccc-b333-000000000003",
      "order": 2,
      "name": "Stabilize Area",
      "description": "A creature in Limbo can take a Magic action to make a DC 20 Intelligence check to stabilize an area within a 30-foot-radius Sphere centered on a point it can see on the plane. On a successful check, the creature prevents the area from being altered by the plane for 24 hours or until the creature takes this Magic action again.",
      "trigger": {
        "event": "OnAbilityCheckMade",
        "condition": "Creature is in Limbo and uses a Magic action to stabilize an area centered on a point it can see on the plane",
        "scope": {
          "abilityScores": ["INT"],
          "customScope": "Target point must be visible to the creature and on the plane of Limbo"
        }
      },
      "effects": [
        {
          "effectType": "CustomEffect",
          "description": "On a successful DC 20 Intelligence check, the creature prevents a 30-foot-radius Sphere centered on a point it can see from being altered by the plane for 24 hours or until the creature takes this Magic action again.",
          "mechanicalNote": "Stabilizes a 30-foot-radius Sphere for 24 hours or until the creature uses this Magic action again. DC 20 Intelligence check. Requires a Magic action."
        }
      ],
      "appliesToSelf": false,
      "appliesToTarget": false,
      "appliesToArea": true,
      "isOptional": true,
      "requiresDMApproval": false
    }
  ],
  "duration": {
    "type": "Special",
    "concentration": false,
    "extendable": false
  },
  "removalConditions": [],
  "stacking": {
    "stacksWithSelf": false,
    "stacksWithOthers": true
  },
  "dmNotes": "Limbo has no gravity; creatures float and can move up to their Speed in any direction by thinking of the desired direction. Nonsapient creatures cannot maintain stable pockets of environment for long. Slaadi create nothing on Limbo, while githzerai build entire monasteries with their minds. The three Magic actions (move object, alter object, stabilize area) all use Intelligence checks but have different DC scales. The stabilize area effect ends early if the creature uses that same Magic action again, even to stabilize a different area.",
  "commonRulings": [
    {
      "question": "Can a creature use the Power of the Mind abilities outside of Limbo?",
      "ruling": "No. The text specifies 'a creature in Limbo' for each ability, so these actions are only available while on the plane of Limbo.",
      "isOfficial": false
    },
    {
      "question": "What happens to the moved or altered object if the area is not stabilized?",
      "ruling": "Limbo's chaos constantly reshapes matter and energy. Without stabilization, objects remain subject to the plane's chaotic transformations and may change form unpredictably.",
      "isOfficial": false
    },
    {
      "question": "Do the DCs for moving objects differ from the DCs for altering objects?",
      "ruling": "Yes. Moving objects: Tiny DC 5, Small DC 10, Medium DC 15, Large DC 20, Huge or larger DC 25. Altering objects: Tiny DC 10, Small DC 15, Medium DC 20, Large or larger DC 25. Altering has higher DCs for smaller objects and a lower size ceiling.",
      "isOfficial": false
    },
    {
      "question": "Can a creature stabilize multiple areas at the same time?",
      "ruling": "No. The stabilization lasts for 24 hours or until the creature takes this Magic action again. Taking the stabilize action again ends the previous stabilization, even if the new attempt fails.",
      "isOfficial": false
    },
    {
      "question": "Does the alter object ability work on magical objects?",
      "ruling": "No. The text specifies 'a nonmagical object' for the alter ability. Magical objects cannot be altered using this feature.",
      "isOfficial": false
    },
    {
      "question": "Can you alter an object into something living?",
      "ruling": "No. The text states the creature changes the object into 'another nonliving form of the same size,' so living forms are not permitted.",
      "isOfficial": false
    }
  ],
  "createdAt": "2025-01-10T12:00:00Z",
  "updatedAt": "2025-01-10T12:00:00Z",
  "version": "1.0.0"
}
