{
  "name": "Summon Fiend",
  "level": 6,
  "school": "Conjuration",
  "classes": ["Warlock", "Wizard"],
  "ritual": false,
  "castingTime": {
    "type": "Action",
    "ritual": false
  },
  "range": {
    "type": "Ranged",
    "distance": 90,
    "unit": "feet"
  },
  "components": {
    "verbal": true,
    "somatic": true,
    "material": {
      "description": "a bloody vial worth 600+ GP",
      "cost": 600,
      "currency": "GP",
      "consumed": false
    }
  },
  "duration": {
    "type": "Timed",
    "concentration": true,
    "amount": 1,
    "unit": "hours"
  },
  "description": "You call forth a fiendish spirit. It manifests in an unoccupied space that you can see within range and uses the Fiendish Spirit stat block. When you cast the spell, choose Demon, Devil, or Yugoloth. The creature resembles a Fiend of the chosen type, which determines certain details in its stat block. The creature disappears when it drops to 0 Hit Points or when the spell ends. The creature is an ally to you and your allies. In combat, the creature shares your Initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don't issue any, it takes the Dodge action and uses its movement to avoid danger.",
  "targetType": "point",
  "mustSeeTarget": true,
  "summonsCreature": {
    "statBlockName": "Fiendish Spirit",
    "creatureType": "Fiend",
    "variantChoices": ["Demon", "Devil", "Yugoloth"],
    "scalesWithSpellLevel": true,
    "baseHP": 50,
    "hpPerLevelAbove": 15,
    "baseAC": 12,
    "acPerSpellLevel": true,
    "attacksEqualHalfSpellLevel": true,
    "description": "Large Fiend, Neutral. AC 12 + the spell's level. HP 50 (Demon only) or 40 (Devil only) or 60 (Yugoloth only) + 15 for each spell level above 6. Speed 40 ft.; Climb 40 ft. (Demon only); Fly 60 ft. (Devil only). STR 13(+1), DEX 16(+3), CON 15(+2), INT 10(+0), WIS 10(+0), CHA 16(+3). Resistances: Fire. Immunities: Poison damage; Poisoned condition. Senses: Darkvision 60 ft., Passive Perception 10. Languages: Abyssal, Infernal, Telepathy 60 ft. CR None (XP 0; PB equals your Proficiency Bonus). Traits — Death Throes (Demon Only): When the spirit drops to 0 HP or the spell ends, it explodes. Dexterity Saving Throw: DC equals your spell save DC, each creature in a 10-foot Emanation. Failure: 2d10 + spell's level Fire damage. Success: Half damage. Devil's Sight (Devil Only): Magical Darkness doesn't impede the spirit's Darkvision. Magic Resistance: The spirit has Advantage on saving throws against spells and other magical effects. Actions — Multiattack: The spirit makes a number of attacks equal to half this spell's level (round down). Bite (Demon Only): Melee Attack Roll: Bonus equals your spell attack modifier, reach 5 ft. Hit: 1d12 + 3 + the spell's level Necrotic damage. Claws (Yugoloth Only): Melee Attack Roll: Bonus equals your spell attack modifier, reach 5 ft. Hit: 1d8 + 3 + the spell's level Slashing damage. Immediately after the attack hits or misses, the spirit can teleport up to 30 feet to an unoccupied space it can see. Fiery Strike (Devil Only): Melee or Ranged Attack Roll: Bonus equals your spell attack modifier, reach 5 ft. or range 150 ft. Hit: 2d6 + 3 + the spell's level Fire damage."
  },
  "higherLevelCasting": {
    "scaling": [
      {
        "type": "custom",
        "baseSpellLevel": 6,
        "description": "Use the spell slot's level for the spell's level in the stat block. The Fiendish Spirit's AC, HP, attack count, and attack damage all scale with the spell slot level used."
      }
    ]
  },
  "tags": ["summoning", "fiend", "concentration", "variant-choice"]
}
