[
  {
    "id": "cackle-fever",
    "name": "Cackle Fever",
    "type": "disease",
    "vector": "Contact with an infected creature or contaminated air in close quarters",
    "saveDC": 13,
    "saveAbility": "CON",
    "incubation": "1d4 days",
    "symptoms": "Random fits of uncontrollable laughter that incapacitate the infected creature",
    "effect": "After the incubation period, the infected creature gains 1 level of Exhaustion, which lasts until the contagion ends. While the creature has the Exhaustion condition, it makes a DC 13 Constitution saving throw each time it takes damage other than Psychic damage. On a failed save, the creature takes 5 (1d10) Psychic damage and has the Incapacitated condition as it laughs uncontrollably. At the end of each of its turns, the creature repeats the save, ending the effect on itself on a success. After 1 minute, it succeeds automatically. Any Humanoid (other than a gnome) that starts its turn within a 10-foot Emanation of an infected creature in the throes of mad laughter must succeed on a DC 10 Constitution saving throw or also become infected. On a successful save, the Humanoid can't catch the contagion from that infected creature for the next 24 hours.",
    "mechanicalEffect": "1 Exhaustion level gained. Taking damage (other than Psychic) triggers DC 13 CON save or 1d10 Psychic damage + Incapacitated (mad laughter) for up to 1 minute. Contagious: DC 10 CON within 10-ft Emanation.",
    "cure": "At the end of each Long Rest, the infected creature makes a DC 13 Constitution saving throw. After the creature succeeds on three of these saves, the contagion ends on it, and the creature is immune to Cackle Fever for 1 year.",
    "description": "This disease targets humanoids, although gnomes are strangely immune. While in the grips of this disease, victims frequently succumb to fits of mad laughter, giving the disease its common name and its morbid nickname: 'the shrieks.'"
  },
  {
    "id": "sewer-plague",
    "name": "Sewer Plague",
    "type": "disease",
    "vector": "Contact with filth or offal, or being bitten by a creature that dwells amid sewage",
    "saveDC": 11,
    "saveAbility": "CON",
    "incubation": "1d4 days",
    "symptoms": "Fatigue, cramps, and exhaustion; the infected creature recovers poorly from rest",
    "effect": "After the incubation period, the infected creature gains 1 level of Exhaustion. While the creature has any Exhaustion levels, it regains only half the normal number of Hit Points from spending Hit Point Dice. While the creature has any Exhaustion levels, finishing a Long Rest neither restores lost Hit Points nor reduces the creature's Exhaustion level. Daily at dawn, an infected creature makes a DC 11 Constitution saving throw. On a failed save, the creature gains 1 Exhaustion level as its fatigue worsens. On a successful save, the creature's Exhaustion level decreases by 1. If the creature's Exhaustion level is reduced to 0, the contagion ends on the creature.",
    "mechanicalEffect": "Gains 1 Exhaustion level. Regains only half HP from Hit Dice. Long Rests don't restore HP or reduce Exhaustion. Daily at dawn: DC 11 CON save—fail adds Exhaustion, success reduces by 1. Cured when Exhaustion reaches 0.",
    "cure": "Daily at dawn, the creature makes a DC 11 Constitution saving throw. Successes reduce Exhaustion by 1; the contagion ends when Exhaustion reaches 0. Failed saves add Exhaustion.",
    "description": "Sewer plague is a generic term for a broad category of illnesses that incubate in sewers, refuse heaps, and stagnant swamps, and which are sometimes transmitted by creatures that dwell in those areas, such as rats and otyughs."
  },
  {
    "id": "sight-rot",
    "name": "Sight Rot",
    "type": "disease",
    "vector": "Drinking contaminated water",
    "saveDC": 15,
    "saveAbility": "CON",
    "incubation": "Immediate",
    "symptoms": "Immediate blindness upon infection",
    "effect": "Any Beast or Humanoid that drinks water tainted by Sight Rot must succeed on a DC 15 Constitution saving throw or have the Blinded condition until the contagion ends. Any Humanoid that makes skin contact with an infected creature must succeed on a DC 15 Constitution saving throw or also become infected. On a successful save, the Humanoid can't catch the contagion from that infected creature for the next 24 hours.",
    "mechanicalEffect": "DC 15 CON save or Blinded until cured. Contagious via skin contact (DC 15 CON).",
    "cure": "Magic such as a Heal or Lesser Restoration spell ends the contagion immediately. A character proficient with an Herbalism Kit can create one dose of nonmagical ointment (takes 1 hour). When applied to the eyes, the ointment suppresses the contagion for 24 hours. If suppressed for a total of 72 hours (three doses and applications), the contagion ends.",
    "description": "This painful infection causes bleeding from the eyes and immediately blinds the victim. A Beast or Humanoid that drinks water tainted by Sight Rot must succeed on a DC 15 Constitution saving throw or become infected."
  },
  {
    "id": "bluerot",
    "name": "Bluerot",
    "type": "disease",
    "vector": "Contact with myconid spores or decaying matter in damp underground environments",
    "saveDC": 12,
    "saveAbility": "CON",
    "incubation": "1d4 days",
    "symptoms": "Blue-green discoloration of skin, fatigue, and hallucinations",
    "effect": "After the incubation period, the infected creature gains 1 level of Exhaustion and has disadvantage on Wisdom saving throws and ability checks. At the end of each Long Rest, the creature must make a DC 12 Constitution saving throw. On a failed save, the creature gains another level of Exhaustion and begins experiencing vivid hallucinations. On a successful save, the creature's Exhaustion level decreases by 1. The disease ends when Exhaustion drops below 1.",
    "mechanicalEffect": "1 Exhaustion level. Disadvantage on WIS saves and checks. Failed saves add Exhaustion. Cured when Exhaustion drops below 1.",
    "cure": "Three successful DC 12 Constitution saving throws at the end of Long Rests (each reduces Exhaustion by 1). A Lesser Restoration or Greater Restoration spell also ends the disease.",
    "description": "Named for the blue-green discoloration it causes on the skin, bluerot is commonly found in damp underground environments where myconids dwell. The spores cause the victim to hallucinate, making them suggestible and confused."
  },
  {
    "id": "filth-fever",
    "name": "Filth Fever",
    "type": "disease",
    "vector": "Bite from a diseased creature or contact with infected waste",
    "saveDC": 11,
    "saveAbility": "CON",
    "incubation": "1d4 days",
    "symptoms": "High fever, sweating, disorientation, and muscle aches",
    "effect": "After the incubation period, the infected creature has disadvantage on Strength checks, Strength saving throws, and attack rolls that use Strength. At the end of each Long Rest, the creature must make a DC 11 Constitution saving throw. On a failed save, the infected creature also has disadvantage on Dexterity checks, Dexterity saving throws, and attack rolls that use Dexterity. Three successful saves in a row end the disease.",
    "mechanicalEffect": "Disadvantage on STR checks/saves/attacks. Failed saves add disadvantage on DEX checks/saves/attacks. Three consecutive successful saves cure.",
    "cure": "Three consecutive successful DC 11 Constitution saving throws at the end of Long Rests. A Lesser Restoration spell also ends the disease.",
    "description": "A raging fever sweeps through the body of the infected creature, leaving them weak and disoriented. Common among those who live or travel through swamps and sewers."
  },
  {
    "id": "flesh-rot",
    "name": "Flesh Rot",
    "type": "disease",
    "vector": "Bite from a carrion-feeding creature or prolonged exposure to decaying flesh",
    "saveDC": 13,
    "saveAbility": "CON",
    "incubation": "1d4 days",
    "symptoms": "Festering sores on the skin that spread over time",
    "effect": "After the incubation period, the infected creature has disadvantage on Charisma checks and vulnerability to all damage. At the end of each Long Rest, the infected creature must make a DC 13 Constitution saving throw. On a failed save, the character gains 1 level of Exhaustion. Three successful saves cure the disease.",
    "mechanicalEffect": "Disadvantage on CHA checks. Vulnerability to all damage. Failed saves add Exhaustion. Three successful saves cure.",
    "cure": "Three successful DC 13 Constitution saving throws at the end of Long Rests. A Greater Restoration spell also ends the disease.",
    "description": "The flesh of the infected creature rots and festers, spreading from the point of infection. The disease makes the victim's body extraordinarily fragile and susceptible to further harm."
  },
  {
    "id": "mindfire",
    "name": "Mindfire",
    "type": "disease",
    "vector": "Psychic assault from an aberration or exposure to Far Realm energies",
    "saveDC": 12,
    "saveAbility": "CON",
    "incubation": "Immediate",
    "symptoms": "Intense headaches, confusion, and difficulty concentrating",
    "effect": "The infected creature has disadvantage on Intelligence checks and Intelligence saving throws, and the creature behaves as if under the effects of the Confusion spell during combat. At the end of each Long Rest, the creature must make a DC 12 Constitution saving throw. Three successful saves cure the disease.",
    "mechanicalEffect": "Disadvantage on INT checks/saves. Confusion effect in combat. Three successful saves cure.",
    "cure": "Three successful DC 12 Constitution saving throws at the end of Long Rests. A Lesser Restoration spell also ends the disease.",
    "description": "This disease inflames the brain, causing delirium and confusion. Victims struggle to form coherent thoughts and may act erratically in stressful situations."
  },
  {
    "id": "seizure",
    "name": "Seizure",
    "type": "disease",
    "vector": "Contact with a diseased creature's blood or fluids",
    "saveDC": 13,
    "saveAbility": "CON",
    "incubation": "1d4 days",
    "symptoms": "Uncontrollable shaking and seizures during stressful situations",
    "effect": "After the incubation period, the infected creature has disadvantage on Dexterity checks, Dexterity saving throws, and attack rolls that use Dexterity. Any time the creature takes damage, it must succeed on a DC 13 Constitution saving throw or be Stunned until the end of its next turn. At the end of each Long Rest, the creature must make a DC 13 Constitution saving throw; three successful saves cure the disease.",
    "mechanicalEffect": "Disadvantage on DEX checks/saves/attacks. Damage triggers DC 13 CON save or Stunned. Three successful saves cure.",
    "cure": "Three successful DC 13 Constitution saving throws at the end of Long Rests. A Greater Restoration spell also ends the disease.",
    "description": "This disease causes the victim's nervous system to fire erratically, resulting in uncontrollable shaking and seizures that can incapacitate the victim when under stress."
  }
]
