{
  "name": "Traveling the Outer Planes",
  "slug": "traveling-the-outer-planes",
  "category": "other",
  "description": "Described in the sections that follow are four planar features that connect multiple Outer Planes:\n\n- The Infinite Staircase\n- The River Oceanus\n- The River Styx\n- Yggdrasil, the World Tree\n\nOther planar crossings might exist in your campaign, or it might be possible to walk (or journey aboard a wondrous train or similar vehicle) from one plane to another in your cosmology.\n\n#### Infinite Staircase\n\nThe **Infinite Staircase** is an extradimensional staircase that connects the planes. An entrance to the Infinite Staircase usually appears as a nondescript door. Beyond the portal lies a small landing with a stairway leading up and down. The Infinite Staircase changes appearance as it climbs and descends, going from simple stairs of wood or stone to a chaotic jumble of stairs hanging in radiant space, where no two steps share the same gravitational orientation. It includes ramps, hovering platforms, and clockwork conveyor belts along its endless construction.\n\nThe adventure anthology *Quests from the Infinite Staircase* provides more details about this planar pathway.\n\nThe staircase is home to **Nafas**, a noble genie created by the planar winds that blow into the expanse through its myriad doors. A distant and benevolent observer, Nafas hears wishes spoken throughout the multiverse—wishes he fulfills with the help of adventurers who happen upon his aeolian palace.\n\nDoors to the Infinite Staircase are often tucked away in dusty, half-forgotten places that no one frequents or pays any attention to. On any given plane, multiple doors might lead to the Infinite Staircase, though entrances aren't common knowledge and are occasionally guarded by devas, sphinxes, yugoloths, and other powerful monsters.\n\n#### River Oceanus\n\nThe water of the Oceanus is sweet and fragrant, as befits its headwaters in the Blessed Fields of Elysium. This plane-spanning waterway provides a path through some of the Upper Planes. It flows through each of Elysium's layers, passes through the top layer of the Beastlands, streams across the top layer of Arborea, and finally drains away somewhere in Arborea's second layer.\n\nThough it isn't as far-reaching as the Styx, the Oceanus is still a commonly used path between planes and layers. Trading vessels sail up and down its length, and small towns line its banks. Travelers can usually find a boat to hire somewhere along its shores.\n\n#### River Styx\n\nThe River Styx bubbles with grease, foul flotsam, and the putrid remains of battles along its banks. The ill effects of the Styx are described under \"Hazards\" in chapter 3.\n\nThe Styx churns through the top layers of Acheron, the Nine Hells, Gehenna, Hades, Carceri, the Abyss, and Pandemonium. Tributaries of the Styx snake through lower layers of these planes. For example, a tendril of the Styx winds through every layer of the Nine Hells, allowing passage from one layer of that plane to the next.\n\nSinister ferries float on the waters of the Styx, crewed by pilots skilled in negotiating the unpredictable currents and eddies of the river. For a price, these pilots carry passengers from plane to plane. Some pilots are Fiends, while others are the souls of dead creatures from the Material Plane.\n\n#### Yggdrasil, the World Tree\n\nThe World Tree, **Yggdrasil**, is a cosmic ash tree that spans the Outer Planes and links them to many worlds of the Material Plane. Its roots stretch into the Lower Planes, touching Hades, Pandemonium, and possibly other Lower Planes. Most of its massive trunk rises through the plane of Ysgard, and its branches stretch through the Upper Planes and across the Astral to the Material Plane.\n\nSome legends describe a great tree, a seedling of Yggdrasil, that the god **Corellon** planted and tended on the First World at the dawn of time. When the First World was destroyed, seeds from this tree scattered into the void and took root to form the worlds of the Material Plane. Thus, many philosophers and naturalists view all trees or even all plants as descendants of Yggdrasil, part of a vast network of plant life across the multiverse.\n\nPlanar travelers can climb among the roots and branches of Yggdrasil to travel from plane to plane or world to world. Some creatures position themselves as expert guides to this vast cosmic network of branching pathways, constantly studying the ever-changing paths as the tree continues its eternal growth.",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
