{
  "name": "Dispel Evil and Good",
  "level": 5,
  "school": "Abjuration",
  "classes": ["Cleric", "Paladin"],
  "ritual": false,
  "castingTime": {
    "type": "Action",
    "ritual": false
  },
  "range": {
    "type": "Self"
  },
  "components": {
    "verbal": true,
    "somatic": true,
    "material": {
      "description": "powdered silver and iron",
      "consumed": false
    }
  },
  "duration": {
    "type": "Timed",
    "concentration": true,
    "amount": 1,
    "unit": "minutes"
  },
  "description": "For the duration, Celestials, Elementals, Fey, Fiends, and Undead have Disadvantage on attack rolls against you. You can end the spell early by using either of the following special functions.\n\nBreak Enchantment. As a Magic action, you touch a creature that is possessed by or has the Charmed or Frightened condition from one or more creatures of the types above. The target is no longer possessed, Charmed, or Frightened by such creatures.\n\nDismissal. As a Magic action, you target one creature you can see within 5 feet of you that has one of the creature types above. The target must succeed on a Charisma saving throw or be sent back to its home plane if it isn't there already. If they aren't on their home plane, Undead are sent to the Shadowfell, and Fey are sent to the Feywild.",
  "targetType": "self",
  "disadvantagesImposed": [
    {
      "on": "attackRolls",
      "condition": "Celestials, Elementals, Fey, Fiends, and Undead attacking you"
    }
  ],
  "conditionsRemoved": ["Charmed", "Frightened"],
  "spellOptions": [
    {
      "name": "Break Enchantment",
      "description": "As a Magic action, you touch a creature that is possessed by or has the Charmed or Frightened condition from one or more creatures of the types above. The target is no longer possessed, Charmed, or Frightened by such creatures."
    },
    {
      "name": "Dismissal",
      "description": "As a Magic action, you target one creature you can see within 5 feet of you that has one of the creature types above. The target must succeed on a Charisma saving throw or be sent back to its home plane if it isn't there already. If they aren't on their home plane, Undead are sent to the Shadowfell, and Fey are sent to the Feywild.",
      "savingThrow": {
        "ability": "Charisma",
        "noEffectOnSuccess": true,
        "effectOnFailure": "Sent back to home plane"
      }
    }
  ],
  "banishment": {
    "savingThrowAbility": "Charisma",
    "affectsCreatureTypes": ["Celestial", "Elemental", "Fey", "Fiend", "Undead"],
    "description": "Target must succeed on a Charisma saving throw or be sent back to its home plane. Undead are sent to the Shadowfell, and Fey are sent to the Feywild."
  },
  "tags": ["protection", "banishment", "dispel", "planar"]
}
