{
  "name": "Kuo-toa Archpriest",
  "slug": "kuo-toa-archpriest",
  "size": "Medium",
  "type": "Aberration",
  "alignment": "Neutral Evil",
  "ac": "13",
  "initiative": "+2 (12)",
  "hp": "105",
  "hpFormula": "14d8 + 42",
  "speed": "30 ft., Swim 30 ft.",
  "abilityScores": {
    "str": 16,
    "dex": 14,
    "con": 16,
    "int": 10,
    "wis": 10,
    "cha": 10
  },
  "abilitySaves": {
    "str": 3,
    "dex": 2,
    "con": 3,
    "int": 0,
    "wis": 0,
    "cha": 0
  },
  "skills": "Perception +9, Religion +4",
  "senses": "Darkvision 120 ft., Truesight 30 ft.; Passive Perception 19",
  "languages": "Undercommon",
  "cr": "6 (XP 2,300; PB +3)",
  "traits": [
    {
      "name": "Amphibious",
      "description": "The kuo-toa can breathe air and water."
    },
    {
      "name": "Sunlight Sensitivity",
      "description": "While in sunlight, the kuo-toa has Disadvantage on ability checks and attack rolls."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "description": "The kuo-toa makes three Strange Scepter attacks."
    },
    {
      "name": "Strange Scepter",
      "description": "*Melee or Ranged Attack Roll:* +6, reach 5 ft. or range 120 ft. *Hit:* 20 (5d6 + 3) Lightning damage."
    },
    {
      "name": "Spellcasting",
      "description": "The kuo-toa casts one of the following spells, requiring no Material components and using Wisdom as the spellcasting ability (spell save DC 14):"
    }
  ],
  "bonusActions": [
    {
      "name": "Shield of Faith (2/Day)",
      "description": "The kuo-toa casts *Shield of Faith*, using the same spellcasting ability as Spellcasting."
    }
  ],
  "reactions": [],
  "legendaryActions": [],
  "lore": "*Fishlike Fanatics of the Deep*\n**Habitat:** Coastal, Underdark; **Treasure:** Relics\nKuo-toa have slimy, humanoid bodies and the heads of goggle-eyed deep-sea fish. They claim they once dominated whole worlds, their empires spanning land and sea under the blessings of piscine gods. The kuo-toa can't say what disaster brought their glorious civilization to an end, but elves, humans, mind flayers, and the kuo-toan gods bear the brunt of their blame. From the lands and seas of the surface, the kuo-toa retreated into cavernous trenches and Underdark seas. In these hidden realms, kuo-toa brood over all they've lost and forgotten, nursing plots to avenge themselves for slights that might never have occurred.\nKuo-toa hate the civilizations of the surface and the Underdark, believing themselves to be victims of age-old slights and ongoing conspiracies. Kuo-toa undertake contrived plots to propel themselves to dominance, often kidnapping people to learn their secrets or making dubious sacrifices to bizarre gods. To facilitate such plots, kuo-toa try to capture creatures alive using nets or strange weapons. Drow, dwarves, and gnomes dwelling in the Underdark, as well as surface communities near submerged subterranean passages, are frequent targets for kuo-toa raids and other plots.\nKuo-toa frequently serve depraved masterminds such as aboleths and krakens. Such kuo-toa believe these powerful creatures are avatars of kuo-toan deities or gods in their own right. Kuo-toa might temporarily ally with other evil creatures, but these alliances shift as kuo-toa leaders interpret omens from their unpredictable deities.\n> \"When the Corpse Moon rises and the Chum-Tide washes in, up rise the Gogglers from their pits beneath the waves. Burbling and noisome they come, fishing night's shores as we do dawn's waves.\" -- Tak Merakin, Harbor Master of the Styes\nKuo-toa loot ruins and raid communities near their dwellings in the Underdark. Their shields are coated in sticky slime, which they use to disarm their foes, and they employ slimy nets to entrap victims. They usually strive to take their enemies alive and drag captives to their hidden lairs.\nMost kuo-toa follow the orders of their more powerful leaders out of a combination of faith and fear. In rare cases, a kuo-toa might abandon its community to live as a hermit or wanderer. Such kuo-toa might know much about the Underdark, but they live in fear of the strange gods they forsook.\nThe servants of kuo-toa archpriests, kuo-toa whips -- so named for their role in enforcing order among other kuo-toa -- lead war bands in carrying out the commands of their superiors. In return for their zeal, these kuo-toa are granted minor magical abilities and pincerlike weapons for subduing foes. In battle, whips drive on other kuo-toa with threats of violence and burbling chants.\nKuo-toa monitors control the day-to-day life of weaker kuo-toa, directing their work and worship. They also train beasts or monsters in the kuo-toa's service -- such as chuuls or giant crabs -- and command them in battle. Archpriests bless monitors with the power to control their underlings and to subdue foes with electricity channeled through their bizarre whips.\nKuo-toa archpriests lead kuo-toa communities by interpreting omens and messages from their strange gods. They wear grotesque ceremonial regalia honoring their deities. Archpriests channel their faith into spells to support their followers.\nKuo-toa ever seek to placate their inscrutable deities. However, few kuo-toa can agree on the identities of their gods, and little consistency exists between kuo-toa communities. Only Blibdoolpoolp the Sea Mother, a figure with a human body but the head and claws of a crayfish, sees broad worship.\nLacking information about what their other gods look like, kuo-toa priests invent new forms for them, creating divine idols with whatever objects are at hand. But whether these kuo-toa priests draw power from belief or delusion, aberrant talent, or a stranger supernatural source, some power answers their petitions. Roll twice on or choose results from the Kuo-toa Deity Features table to inspire how kuo-toa represent a deity.\nKuo-toa typically organize their communities around sites they believe to be important to their deities. These might be structures or series of caverns, and most feature both air-filled and submerged chambers. Important places within these sites suggest the rituals of kuo-toa faiths, the demands of kuo-toa deities, or the whims of omen-seeking archpriests. As with kuo-toa deities, the features of these locations vary between communities. Roll on or choose a result from the Kuo-toa Ritual Sites table to inspire features and suggest adventures within a kuo-toa community.\n> \"They came here from somewhere else and brought with them all the rank and dank of the Sunless Sea. No one knows what they want, and seems to me, neither do they.\" -- Trosli Garnetgetter, Gnome Explorer",
  "habitat": "Coastal, Underdark",
  "treasure": "Relics",
  "source": {
    "book": "2025 Monster Manual",
    "section": "Humanoids",
    "file": "Humanoids.md"
  }
}
