{
  "name": "Water/Food Needs per Day",
  "slug": "water-food-needs-per-day",
  "description": "| Size | Water | Food |\n|---|---|---|\n| Tiny | 1/4 gallon | 1/4 pound |\n| Small | 1 gallon | 1 pound |\n| Medium | 1 gallon | 1 pound |\n| Large | 4 gallons | 4 pounds |\n| Huge | 16 gallons | 16 pounds |\n| Gargantuan | 64 gallons | 64 pounds |\n**Difficult Terrain.** If a space is Difficult Terrain, every foot of movement in that space costs 1 extra foot.\n**Difficulty Class (DC).** A Difficulty Class is the target number for an ability check or saving throw. It represents the difficulty of a task.\n**Disadvantage.** If you have Disadvantage on a D20 Test, roll two d20s and use the lower roll. A roll can't be affected by more than one source of Disadvantage, and Advantage and Disadvantage on the same roll cancel each other, regardless of the number of each.\n**Encounter.** An encounter is a scene in an adventure that is defined by an interesting challenge, like a battle, a social negotiation, or a dangerous hazard.\n**Experience Points (XP).** Experience Points are a measure of a character's progress toward gaining a level. When a character earns enough XP, the character advances in level.\n**Falling.** A creature falls when there is nothing holding it up. A falling creature drops up to 500 feet per turn. At the end of a fall, a creature takes 1d6 Bludgeoning damage for every 10 feet it fell, to a maximum of 20d6. The creature has the Prone condition when it lands, unless it avoids taking damage from the fall.\n**Flying.** If a flying creature has the Incapacitated or Prone condition or its Fly Speed is reduced to 0, the creature falls unless it can hover or is being held aloft by magic.\n**Food.** A creature requires food each day based on its size (see Water/Food Needs per Day table). A creature that eats but consumes less than half the required food must succeed on a DC 15 Constitution saving throw at the end of the day or gain 1 Exhaustion level. A creature that eats nothing automatically gains 1 Exhaustion level at the end of the day.\n**Grappling.** When you take the Attack action, you can replace one of your attacks with a grapple attempt. The target must be no more than one size larger than you, and it must be within your reach. You make a Strength (Athletics) check against the target's escape DC (8 + its Strength modifier + its Proficiency Bonus). On a success, the target has the Grappled condition.\n**Heavily Obscured.** You have the Blinded condition while trying to see something in a Heavily Obscured area. A Heavily Obscured area — such as Darkness, thick fog, or dense foliage — blocks vision entirely.\n**Heroic Inspiration.** If you have Heroic Inspiration, you can expend it when you make a D20 Test to give yourself Advantage on the roll. You either have Heroic Inspiration or you don't; you can't stockpile multiple instances. If you have it when you gain it, you can give it to another character in your group.\n**Hit Point Dice (Hit Dice).** A character's Hit Dice are determined by class. Roll your Hit Die + your Constitution modifier to determine how many Hit Points you regain when you spend a Hit Die during a Short Rest.\n**Hit Points (HP).** Hit Points represent a combination of physical and mental durability, the will to live, and luck. Creatures with more Hit Points are harder to kill. A creature's current Hit Points can be any number from the creature's Hit Point maximum down to 0.\n**Hostile.** A Hostile creature views you as a foe.\n**Immunity.** If you have Immunity to a damage type, damage of that type doesn't reduce your Hit Points. If you have Immunity to a condition, you aren't affected by it.\n**Indifferent.** An Indifferent creature has no strong feelings about you one way or another.\n**Influence.** The Influence action lets you use a Charisma check (Deception, Intimidation, Performance, or Persuasion) or Wisdom (Animal Handling) check to shift a creature's attitude.\n**Initiative.** Initiative determines the order of turns during combat. When combat starts, every participant makes a Dexterity check to determine their place in the Initiative order. The DM makes one roll for an entire group of identical creatures.\n**Jumping.** When you take the Jump action, you make a Strength (Athletics) check and cover a number of feet up to the check's total (Long Jump) or one-quarter that total (High Jump, minimum 1 foot). Each foot cleared on a jump costs a foot of movement. If you spend no movement before jumping, the distances are halved. If you land in Difficult Terrain, you must make a DC 10 Dexterity (Acrobatics) check or have the Prone condition.\n**Knocking a Creature Out.** When an attacker reduces a creature to 0 HP with a melee attack, the attacker can knock the creature out, leaving it with the Unconscious condition instead of killing it.\n**Lightly Obscured.** You have Disadvantage on Wisdom (Perception) checks to see something in a Lightly Obscured area. A Lightly Obscured area — such as Dim Light, patchy fog, or moderate foliage — makes details harder to see.\n**Light.** Three categories of illumination:\n- **Bright Light.** Lets most creatures see normally.\n- **Dim Light.** Creates a Lightly Obscured area.\n- **Darkness.** Creates a Heavily Obscured area.\n**Line of Sight.** To target something, you must have a clear path to it, so it can't be behind Total Cover.\n**Long Rest.** A Long Rest is a period of extended downtime — at least 8 hours — during which you sleep for at least 6 hours and perform no more than 2 hours of light activity. You can't benefit from more than one Long Rest in a 24-hour period. At the end of a Long Rest, you regain all lost Hit Points and spent Hit Point Dice (up to a number equal to half your total Hit Dice, minimum of one die).\n**Melee Attack.** A melee attack is an attack made against a target within reach (usually 5 ft.). It can be a melee weapon attack or a melee spell attack.\n**Mounted Combat.** A willing creature at least one size larger than you that has an appropriate anatomy can serve as a mount. While mounted, you can choose whether the mount acts independently or you control it. A controlled mount shares your Initiative count and can only take the Dash, Disengage, or Dodge action.\n**Multiclassing.** Multiclassing lets you gain levels in multiple classes. You must meet the ability score prerequisites for both your current class and the new class.\n**Opportunity Attack.** You can make an Opportunity Attack when a creature you can see leaves your reach using its movement, action, or Reaction. You use your Reaction to make one melee attack against the provoking creature. The attack occurs right before the creature leaves your reach.\n**Passive Perception.** Passive Perception = 10 + the creature's Wisdom (Perception) modifier. Advantage adds 5; Disadvantage subtracts 5.\n**Per Day.** A game feature that can be used a certain number of times per day regains all expended uses when you finish a Long Rest.\n**Proficiency Bonus.** A Proficiency Bonus is added to D20 Tests you're proficient in and to your spell save DC. It is determined by your level. You never add your Proficiency Bonus more than once to the same roll.",
  "category": "Rule",
  "source": {
    "book": "2024 Players Handbook",
    "chapter": "Appendix C",
    "section": "Rules Glossary"
  }
}
