{
  "name": "Far Realm",
  "slug": "far-realm",
  "category": "other",
  "description": "The Far Realm is outside the known multiverse. In fact, it might be an entirely separate universe with its own physical and magical laws. Where stray energies from the Far Realm leak onto another plane, matter is warped into alien shapes that defy understandable geometry and biology. Aberrations such as mind flayers and beholders are either from this plane or shaped by its strange influence.\n\nThe entities that abide in the Far Realm are too alien for mortal minds to accept without strain. Titanic creatures swim through nothingness there, and unspeakable beings whisper awful truths to those who dare listen. For mortals, knowledge of the Far Realm is a struggle of the mind to overcome the boundaries of matter, space, and rational thought. Some Warlocks embrace this struggle by forming pacts with entities there. Anyone who has seen the Far Realm mutters about eyes, tentacles, and horror.\n\nThe Far Realm has no well-known portals, or at least none that are still viable. Ancient elves once opened a vast portal to the Far Realm within a mountain called **Firestorm Peak**, but their civilization imploded in bloody terror, and the portal's location—even its home world—is long forgotten. Lost portals might still exist, marked by an alien magic that transforms the surrounding area.\n\n#### Far Realm Adventures\n\nThe Far Realm is the home of entities so far beyond comprehension that mortals can't fathom their motivations. To see these beings is to become lost in their magnitude and the evidence that mortals have never, will never, and could never matter to the cosmos at large.\n\nAdventures involving travel to the Far Realm or its influence seeping into the Material Plane might touch on fundamental questions of what it means to be a person, what mental and bodily autonomy mean and their value, and whether mortals have any control over their fate or any importance in the grand scheme of things. (It's an especially good idea to review your players' limits that might pertain to such issues before planning an adventure exploring these themes, as discussed in the \"Ensuring Fun for All\" section in chapter 1.)\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
