{
  "name": "Para-elemental Planes",
  "slug": "para-elemental-planes",
  "category": "other",
  "description": "The regions where the Elemental Planes collide and their elemental substances overlap are called the **Para-elemental Planes**.\n\n#### Plane of Ash\n\nOn the **Plane of Ash**, also called the **Great Conflagration**, howling winds from the Plane of Air mix with the cinder storms and lava of the Sea of Fire. This plane is an endless storm of flames, smoke, and ash. The thick ash obscures sight beyond a few dozen feet, and the battering winds make travel difficult. Here and there, ash clusters into floating realms where outlaws and fugitives take shelter.\n\n#### Plane of Ice\n\nThe **Plane of Ice**, also called the **Frostfell**, forms the border between the Plane of Air and the Plane of Water. This plane is a seemingly endless glacier swept by constant, raging blizzards. Frozen caverns wind through the Plane of Ice, home to yetis, white dragons, and other creatures of cold. The inhabitants of the plane engage in a never-ending battle to prove their strength and ensure their survival.\n\nThe Frostfell's monsters and bitter cold make it a dangerous place to travel. Most planar voyagers keep to the air, braving the powerful winds and driving snow to avoid setting foot on the great glacier.\n\n#### Plane of Magma\n\nThe boundary between the Plane of Earth and the Plane of Fire is a great range of volcanic mountains. The **Plane of Magma**, also called the **Fountains of Creation**, is home to azers, fire giants, and red dragons, as well as creatures from the neighboring planes. Lava flows down the slopes of these mountains toward the Plane of Fire.\n\n#### Plane of Ooze\n\nThe border region between the Plane of Water and the Plane of Earth is a horrid swamp where gnarled trees and thick, stinging vines grow from the dense muck and slime. Here and there on the **Plane of Ooze** (also called the **Swamp of Oblivion**), stagnant lakes and pools play host to thickets of weeds and monstrous swarms of mosquitoes. The few settlements here consist of wooden structures suspended above the muck on platforms between trees.\n\nVisitors to the plane have sometimes tried elevating houses on poles stuck in the mud, but since no solid earth underlies the muck, even such structures eventually sink. It is said that any object cast into the Swamp of Oblivion can't be found again for at least a century. Now and then, a desperate soul casts an Artifact of power into this place, keeping it away from the rest of the multiverse for a time. The promise of powerful magic lures adventurers to brave the monstrous insects and hags of the swamp.\n\n#### Para-elemental Plane Adventures\n\nThe Para-elemental Planes are extreme environments but fundamentally similar to places found on the Material Plane—the place where all four elements mingle freely.\n\nAt a symbolic level, the Para-elemental Planes represent the interaction and sometimes the contrast between the forces and ideals embodied by their constituent elements. The Plane of Ash, for example, highlights the commonality between air and fire—the tendency to movement and change, given a destructive tone by the raging conflagration of the plane. The Plane of Ooze heightens the contrast between stable, rigid earth and steadily flowing water.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
