{
  "name": "Astral Plane",
  "slug": "astral-plane",
  "category": "transitive",
  "description": "The Astral Plane is a realm of thought and dream, where visitors travel as disembodied souls to reach the Outer Planes. It is a great silvery sea, the same above and below, with swirling wisps of white and gray streaking among motes of light—the distant stars of far-flung Wildspace systems. Most of the Astral Sea is a vast, empty expanse. Visitors occasionally stumble upon the petrified corpse of a dead god or other chunks of rock drifting forever in the silvery void. Much more commonplace are color pools—magical pools of colored light that flicker like radiant, spinning coins.\n\nCreatures on the Astral Plane don't age or suffer from hunger or thirst. For this reason, creatures that live on the Astral Plane (such as githyanki) establish outposts on other planes, often the Material Plane, so their children can grow to maturity.\n\n#### Navigating the Astral Plane\n\nA traveler in the Astral Plane can move by simply thinking about moving, but distance has little meaning. In combat, though, a creature has a Fly Speed (in feet) equal to 5 times its Intelligence score and can hover.\n\nJust as movement is accomplished by the power of thought, all that is required to find one's destination is to think about it. As long as the destination is somewhere in the Astral Plane (or in Wildspace, as described below)—such as \"the nearest githyanki outpost,\" \"the nearest color pool leading to the Abyss,\" or \"the Wildspace system of Realmspace\"—thinking about a place makes the creature aware of the most direct route to that location. The creature doesn't know how long the journey will take or how perilous it will be, just which direction to go in.\n\nThe DM decides how long it takes to get to a desired destination. A trek to a specific location—a particular Wildspace system or Astral outpost, for example—might take 4d6 days. For a more general location, such as a color pool leading to a specified plane, the journey might take 1d4 × 10 hours.\n\n#### Dead Gods\n\nThe Astral Plane is where the petrified remains of dead gods end up—gods who were slain by more powerful entities or who lost all their mortal worshipers and perished as a result. A dead god looks like a gigantic, nondescript stone statue that bears little resemblance to the divine entity it once was.\n\nGithyanki, mind flayers, and other residents of the Astral Plane sometimes turn these drifting hulks into outposts and cities, many of which are hollowed out beneath the surface. The githyanki city of **Tu'narath** is perhaps the most infamous such place.\n\n#### Color Pools\n\nGateways leading from the Astral Plane to other planes appear as two-dimensional pools of rippling colors, 1d6 × 10 feet in diameter. (\"Color,\" as with everything in the Astral Plane, is a matter of metaphor; since these portals are perceived by the Astral self and not by physical eyes, their colors are understood rather than seen.) Traveling to another plane requires locating a color pool that leads to the desired plane. These gateways can be identified by color, as shown on the Astral Color Pools table.\n\n| d20 | Plane | Pool Color |\n|---|---|---|\n| 1 | Abyss | Amethyst |\n| 2 | Acheron | Flame red |\n| 3 | Arborea | Sapphire blue |\n| 4 | Arcadia | Saffron |\n| 5 | Beastlands | Emerald green |\n| 6 | Bytopia | Amber |\n| 7 | Carceri | Olive |\n| 8 | Elysium | Orange |\n| 9 | Ethereal Plane | Spiraling white |\n| 10 | Gehenna | Russet |\n| 11 | Hades | Rust |\n| 12 | Limbo | Jet black |\n| 13–14 | Material Plane | Silver |\n| 15 | Mechanus | Diamond blue |\n| 16 | Mount Celestia | Gold |\n| 17 | Nine Hells | Ruby |\n| 18 | Outlands | Leather brown |\n| 19 | Pandemonium | Magenta |\n| 20 | Ysgard | Indigo |\n\n#### Wildspace\n\nBobbing in the Astral Plane like corks in an ocean are vast, airless expanses called **Wildspace systems**. In these systems, the Astral Plane overlaps with the Material Plane, and the stars and planets of the Material Plane are accessible from the Astral Plane. Every world of the Material Plane is situated in a Wildspace system.\n\nAs an Astral traveler approaches a Wildspace system, the silver fog of the Astral Plane gradually thins until it falls away in Wildspace. Then the sun of the Wildspace system comes into view—often millions of miles away—along with colorful gas clouds, planets, moons, and other cosmic bodies.\n\nA Wildspace system teems with space-dwelling life-forms, including spores, plankton, and larger creatures that resemble fish and aquatic mammals. Creatures and objects in Wildspace age normally and exist on both the Astral Plane and Material Plane simultaneously. This overlap enables creatures to use spells such as *Teleport* to travel from Wildspace to a nearby world, or vice versa. A creature or ship traveling from one Wildspace system to another must cross the Astral Plane unless it has some other magical means of traveling from one world to another. (See \"Material Plane\" in this chapter.)\n\n*Spelljammer: Adventures in Space* contains extensive information about Wildspace and Astral travel.\n\n#### Psychic Wind\n\nA psychic wind is a storm of thought that batters travelers' minds rather than their bodies. The storm is made of lost memories, forgotten ideas, and subconscious fears that went astray in the Astral Plane and conglomerated into this powerful force.\n\nA psychic wind is first sensed as a rapid darkening of the silver-gray sky. After 1d4 minutes, the area becomes as dark as a moonless night. As the sky darkens, the traveler feels buffeting and shaking, as if the plane were rebelling against the storm. As quickly as it comes, the psychic wind passes, and the sky returns to normal in 1 minute.\n\nA group of travelers journeying together is subjected to one location effect, determined by consulting the Psychic Wind Location Effects table.\n\n**Psychic Wind Location Effects**\n\n| d20 | Location Effect |\n|---|---|\n| 1–8 | Diverted; add 1d6 days to travel time |\n| 9–12 | Blown astray; add 3d10 days to travel time |\n| 13–16 | Lost; at the end of the travel time, the characters arrive at a location other than the intended destination |\n| 17–20 | Sent through a random color pool (roll on the Astral Color Pools table) |\n\nEach traveler caught in a psychic wind makes a DC 15 Intelligence saving throw. On a failed save, the traveler suffers a random effect from the Psychic Wind Psychic Effects table as well.\n\n**Psychic Wind Psychic Effects**\n\n| d20 | Psychic Effect |\n|---|---|\n| 1–8 | You have the Stunned condition for 1 minute; you repeat the saving throw at the end of each of your turns, ending the effect on yourself on a success. |\n| 9–12 | You take 11 (2d10) Psychic damage. |\n| 13–17 | You take 22 (4d10) Psychic damage. |\n| 18–20 | You have the Unconscious condition for 5 (1d10) hours; the effect on you ends if you take damage or if another creature takes an action to shake you awake. |\n\n#### Astral Plane Adventures\n\nCharacters most often visit the Astral Plane as a way of getting somewhere else—either to one of the Outer Planes or to different worlds of the Material Plane via Wildspace. En route, they might encounter fellow travelers, such as Celestials, Fiends, slaadi, modrons, or githyanki.\n\nAs a realm of thought, memory, and dream, the Astral Plane can also be an adventure destination. Characters might try to plumb the crystallized thoughts of dead gods or sift information from the torrent of a psychic wind. Or they could face Astral manifestations of their own memories, fears, and dreams.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
