{
  "name": "Ethereal Plane",
  "slug": "ethereal-plane",
  "category": "transitive",
  "description": "The Ethereal Plane is a misty, fog-bound dimension. Its \"shores,\" called the **Border Ethereal**, overlap the Material Plane, the Feywild, the Shadowfell, and the Inner Planes, and every location on those planes has a corresponding location on the Ethereal Plane. Visibility in the Border Ethereal is usually limited to 60 feet. The plane's depths comprise a region of swirling mist and fog called the **Deep Ethereal**, where visibility is usually limited to 30 feet.\n\nCharacters can use the *Etherealness* spell to enter the Border Ethereal. The *Plane Shift* spell allows transport to the Border Ethereal or the Deep Ethereal, but unless the intended destination is a specific location or a teleportation circle, the point of arrival could be anywhere on the plane.\n\n#### Border Ethereal\n\nFrom the Border Ethereal, a traveler can see into whatever plane it overlaps, but that plane appears grayish and indistinct, its colors blurring into each other and its edges turning fuzzy, limiting visibility to 30 feet into the other plane. Conversely, the Ethereal Plane is usually imperceptible to those on the overlapped planes, except with the aid of magic.\n\nNormally, creatures in the Border Ethereal can't attack creatures on the overlapped plane, and vice versa. A traveler on the Ethereal Plane is imperceptible to someone on the overlapped plane, and solid objects on the overlapped plane don't hamper the movement of a creature in the Border Ethereal. The exceptions are certain magical effects (including anything made of magical force) and living beings. This makes the Ethereal Plane ideal for scouting, spying on opponents, and moving around without being detected. The Ethereal Plane also disobeys the laws of gravity; a creature there can freely move in any direction.\n\n#### Deep Ethereal\n\nTo reach the Deep Ethereal, one typically needs a *Plane Shift* spell, a *Gate* spell, or a magical portal. Visitors to the Deep Ethereal are engulfed by roiling mist. Scattered throughout the plane are curtains of vaporous color, and passing through a curtain leads a traveler to a region of the Border Ethereal connected to a specific Inner Plane, the Material Plane, the Feywild, or the Shadowfell. The color of the curtain indicates the plane whose Border Ethereal the curtain conceals; see the Ethereal Curtains table. The curtains are also distinguishable by texture and temperature, each one reflecting something of the nature of the plane beyond.\n\n#### Ethereal Curtains\n\n| d12 | Plane | Curtain Color |\n|---|---|---|\n| 1–2 | Material Plane | Turquoise |\n| 3 | Shadowfell | Dusky gray |\n| 4 | Feywild | Opalescent |\n| 5 | Elemental Plane of Air | Pale blue |\n| 6 | Elemental Plane of Earth | Chestnut |\n| 7 | Elemental Plane of Fire | Orange |\n| 8 | Elemental Plane of Water | Green |\n| 9 | Para-elemental Plane of Ash | Dark gray |\n| 10 | Para-elemental Plane of Ice | Aquamarine |\n| 11 | Para-elemental Plane of Magma | Maroon |\n| 12 | Para-elemental Plane of Ooze | Chocolate |\n\nTraveling through the Deep Ethereal is unlike physical travel. Distance is meaningless, so although travelers feel as if they can move by a simple act of will, it's impossible to measure speed and hard to track the passage of time. A trip through the Deep Ethereal takes 1d10 × 10 hours from one curtain to another, regardless of the origin and destination. In combat, creatures move at their normal speeds.\n\n#### Ether Cyclones\n\nAn ether cyclone is a serpentine column that spins through the plane. The cyclone appears abruptly, distorting and uprooting everything in its path and carrying the debris for miles. Travelers with a Passive Perception score of 15 or higher receive 1 minute of warning: a deep thrum in the ethereal matter. Travelers who can't reach a curtain or portal leading elsewhere suffer the cyclone's effect. Roll 1d20 and consult the Ether Cyclone table to determine the effect on all creatures in the vicinity.\n\n| d20 | Effect |\n|---|---|\n| 1–12 | **Extended journey.** Each character in a group traveling together makes a DC 15 Charisma saving throw. If at least half the group succeeds, travel is delayed by 1d10 hours. Otherwise, the journey's travel time is doubled. |\n| 13–19 | **Blown to a random location** in the Border Ethereal overlapping a random plane (roll on the Ethereal Curtains table). |\n| 20 | **Hurled to a random destination** on the Astral Plane. |\n\n#### Radiant Citadel\n\nAgainst the unending mist and unseen terrors of the Ethereal Plane, the **Radiant Citadel** stands bright as a bastion of hope. It's a living relic of the ingenuity and collaboration of twenty-seven great civilizations on the Material Plane. Abandoned and lost for ages, the Radiant Citadel was resurrected from its slumber and reclaimed by descendants of those societies.\n\nThe Radiant Citadel is a nexus of diplomacy and trade, a repository of histories and secrets, and a thriving sanctuary for those seeking safety or a better life. The floating city is a miracle of architecture carved out of a single, massive fossil that snakes around a colossal gemstone shard known as the **Auroral Diamond**. The luminescence of the Auroral Diamond is mirrored in the constellation of fifteen structure-sized gemstones, the **Concord Jewels**, that orbit the city and provide transportation to the far-flung homes of the city's founding civilizations.\n\nIn the haze of the Ethereal Plane, the Auroral Diamond is a scintillating beacon visible from miles away. The diamond seems to have moods, changing colors unpredictably, but it is always visible for wanderers lost and in need. Just beyond the city whirls a massive ether cyclone known as the **Keening Gloom**—a looming threat that's a grim reminder of the Radiant Citadel's precarious position.\n\nHeroes and paupers meet on equal footing in the Radiant Citadel. By common agreement, power and resources are equitably shared. Dignity is afforded to all, and great need is met with great aid.\n\n#### Ethereal Plane Adventures\n\nAdventurers typically use the Ethereal Plane to travel from one place to another, either skirting around Material Plane obstacles on the Border Ethereal or venturing into the Deep Ethereal to travel to the Inner Planes. The Radiant Citadel can serve as a home base for any campaign built around the idea of exploring new worlds. Several such worlds are introduced in *Journeys through the Radiant Citadel*, an anthology of short adventures.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
