{
  "name": "Material Plane",
  "slug": "material-plane",
  "category": "material",
  "description": "Worlds of the Material Plane are infinitely diverse, but it was not always so. Some legends speak of a primordial state, a single reality called the **First World**, where many of the peoples and monsters that inhabit the worlds on the Material Plane originated. After the First World was shattered by a great cataclysm, the many worlds were formed like reflections or (in some cases) distortions of that original reality.\n\nSome myths describe a great tree that grew on the First World at the dawn of time. Planted and tended by the god **Corellon**, this tree was a seedling of **Yggdrasil**, the World Tree that connects all the Outer Planes (see \"Traveling the Outer Planes\" earlier in this chapter). When the First World was destroyed, seeds from this great tree scattered into the void of the Material Plane. Legends say that these seeds sprouted and formed worlds of their own—all the myriad worlds that now constitute the Material Plane.\n\nThe most widely known worlds are the ones that have been published as official campaign settings for the D&D game over the years, many of which are shown on the D&D Settings table in chapter 5. If your campaign takes place in one of these settings, your version of it can diverge wildly from what's in print.\n\n#### Traveling Between Worlds\n\nTransit between the worlds of the Material Plane is rare but not impossible and can be accomplished in a variety of ways.\n\n**The Dream of Other Worlds.** Aided by magic, travelers can fall into a deep slumber and dream themselves into a new realm.\n\n**The Great Journey.** Characters can undertake an epic voyage fraught with peril and obstacles to be overcome. One route leads through Wildspace and across the Astral Plane aboard a vessel powered by magic. (The \"Astral Plane\" section in this chapter describes Wildspace.) It is also possible to travel through the Shadowfell or the Feywild, though such routes are less charted and no less perilous.\n\n**The Leap to Another Realm.** The most direct method involves the use of spells such as *Teleportation Circle* or *Teleport*, or magical portals like those described in this chapter. This magic causes the user to appear in a known teleportation circle or some other location in another world.\n\n**The Roots of the Worlds.** Similar to magical portals, nexus points are locations that exist in multiple worlds at the same time. These points might be located at or near the roots of the worlds—the places where the seedlings of the First World's great tree took root and grew into a new world. A nexus point can be a geographical feature, such as an enormous tree, a mountain or mesa, a yawning cavern deep under the mountains, or a meteorite in an enormous crater. It might also be a constructed feature: a lonely tower or castle, a bustling tavern, or even a city. Normally, visitors to these places return to the same world they came from when they depart, but it's also possible to use a nexus point to travel from one world to another. Depending on the place, shifting worlds might require the use of magic, an object from the desired destination world as a sort of key, or nothing more than an act of will.\n\nSome nexus points exist in multiple worlds—but not at the same time. They flit from world to world, disappearing from one and appearing in another according to a regular schedule. Such a place might linger on one world for anywhere from a year to an hour before moving on to another, carrying everyone inside with it to a new world.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
