{
  "name": "Event Descriptions",
  "slug": "event-descriptions",
  "type": "",
  "level": "",
  "space": "",
  "hirelings": "",
  "order": "",
  "description": "The events from the Bastion Events table are detailed here in alphabetical order.\n\n#### All Is Well\n\nNothing significant happens. Roll on the following table, fleshing out the details as you see fit.\n\n| 1d8 | Details |\n|---|---|\n| 1 | Accident reports are way down. |\n| 2 | The leak in the roof has been fixed. |\n| 3 | No vermin infestations to report. |\n| 4 | You-Know-Who lost their spectacles again. |\n| 5 | One of your hirelings adopted a stray dog. |\n| 6 | You received a lovely letter from a friend. |\n| 7 | Some practical joker has been putting rotten eggs in people's boots. |\n| 8 | Someone thought they saw a ghost. |\n\n#### Attack\n\nA hostile force attacks your Bastion but is defeated. Roll 6d6; for each die that rolls a 1, one Bastion Defender dies. Remove these Bastion Defenders from your Bastion's roster. If the Bastion has zero Bastion Defenders, one of the Bastion's special facilities (determined randomly) is damaged and forced to shut down.\n\nA special facility that shuts down can't be used on your next Bastion turn, after which it is repaired and made operational again at no cost to you.\n\n#### Criminal Hireling\n\nOne of your Bastion's hirelings has a criminal past that comes to light when officials or bounty hunters visit your Bastion with a warrant for the hireling's arrest. You can retain the hireling by paying a bribe of 1d6 x 100 GP. Otherwise, the hireling is arrested and taken away. If this loss leaves one of your facilities without any hirelings, that facility can't be used on your next Bastion turn. The hireling is then replaced at no cost to you.\n\n#### Extraordinary Opportunity\n\nYour Bastion is given the opportunity to host an important festival or celebration, fund the research of a powerful spellcaster, or appease a domineering noble. Work with the DM to determine the details.\n\nIf you seize the opportunity, you must pay 500 GP to cover costs. In return, your Bastion gains a sudden influx of recognition or attention, prompting the DM to roll again on the Bastion Events table (rerolling this result if it comes up again).\n\nIf you decline the opportunity, you don't pay the money and nothing else happens.\n\n#### Friendly Visitors\n\nFriendly visitors come to your Bastion, seeking to use one of your special facilities. They offer 1d6 x 100 GP for the brief use of that facility. For example, a knight might want your Smithy to replace a horseshoe or repair a damaged weapon or suit of armor, or sages might need your Arcane Study to help them settle a dispute. Their use of the facility doesn't interrupt any orders you've issued to it.\n\n#### Guest\n\nA Friendly guest comes to stay at your Bastion. Determine the guest by rolling on the following table, and work with your DM to flesh out the details.\n\n| 1d4 | Guest |\n|---|---|\n| 1 | The guest is an individual of great renown who stays for 7 days. At the end of their stay, the guest gives you a letter of recommendation (see \"Marks of Prestige\" in chapter 3). |\n| 2 | The guest requests sanctuary while avoiding persecution for their beliefs or crimes. They depart 7 days later, but not before offering you a gift of 1d6 x 100 GP. |\n| 3 | The guest is a mercenary, giving you one additional Bastion Defender. The guest doesn't require a facility to house them, and they stay until you send them away or they're killed. |\n| 4 | The guest is a Friendly monster, such as a brass dragon or a treant. If your Bastion is attacked while this monster is your guest, it defends your Bastion, and you lose no Bastion Defenders. The monster leaves after it defends your Bastion once or when you send it away. |\n\n> **Bastion Tracker**\n>\n> Players can use the Bastion Tracker sheet as a record of the facilities and other characteristics of their Bastions. Encourage your players to list their hirelings on this sheet and develop them more fully as NPCs on separate sheets (perhaps using the NPC Tracker in chapter 3). Similarly, the Bastion Tracker provides space to indicate the space of each special facility, but encourage players to draw maps of their Bastions (see \"Bastion Map\" earlier in this chapter).\n\n#### Lost Hirelings\n\nOne of your Bastion's special facilities (determined randomly) loses its hirelings. The cause of their departure is up to you. The facility can't be used on your next Bastion turn, but the hirelings are replaced at no cost to you at that point.\n\n#### Magical Discovery\n\nYour hirelings discover or accidentally create an Uncommon magic item of your choice at no cost to you. The magic item must be a Potion or Scroll.\n\n#### Refugees\n\nA group of 2d4 refugees fleeing from a monster attack, a natural disaster, or some other calamity seeks refuge in your Bastion. If your Bastion lacks a basic facility large enough to house them, the refugees camp right outside the Bastion. The refugees offer you 1d6 x 100 GP as payment for your hospitality and protection. They stay until you find them a new home or a hostile force attacks your Bastion.\n\n#### Request for Aid\n\nYour Bastion is called on to help a local leader. Perhaps there's a search on for a missing person, or brigands are plaguing the area. If you help, you must dispatch one or more Bastion Defenders. Roll 1d6 for each Bastion Defender you send. If the total is 10 or higher, the problem is solved and you earn a reward of 1d6 x 100 GP. If the total is less than 10, the problem is still solved, but the reward is halved and one of your Bastion Defenders is killed. Remove that Bastion Defender from your Bastion's roster.\n\n#### Treasure\n\nYour Bastion acquires an art object or a magic item determined by rolling on the table below and then rolling on the specified table in chapter 7. How your Bastion acquires this treasure is up to you. It might represent an inheritance, a gift from a guest or an admirer, a theft, or a fortunate discovery. If you're in the Bastion, you can claim the treasure immediately; otherwise, it is placed in storage until you can claim it.\n\n| 1d100 | Treasure |\n|---|---|\n| 01-40 | Roll on the 25 GP Art Objects table. |\n| 41-63 | Roll on the 250 GP Art Objects table. |\n| 64-73 | Roll on the 750 GP Art Objects table. |\n| 74-75 | Roll on the 2,500 GP Art Objects table. |\n| 76-90 | Roll on a Common Magic Items table of your choice (Arcana, Armaments, Implements, or Relics). |\n| 91-98 | Roll on an Uncommon Magic Items table of your choice (Arcana, Armaments, Implements, or Relics). |\n| 99-00 | Roll on a Rare Magic Items table of your choice (Arcana, Armaments, Implements, or Relics). |\n\n## Fall of a Bastion\n\nA player character can lose their Bastion in the following ways:\n\n**Divestiture.** A character can give up their Bastion anytime, releasing the Bastion's hirelings and abandoning the location. The divested Bastion is quickly vacated, is eventually looted, and might even be burned to the ground.\n\n**Neglect.** If a character issues no orders to their Bastion for a number of consecutive Bastion turns equal to the character's level (typically because the character is dead or otherwise out of commission), the hirelings abandon the Bastion and the site is eventually looted. If the character returns later, they can start a new Bastion, perhaps building it amid the ruins of the old one.\n\n**Ruination.** Drawing the Ruin card from the *Deck of Many Things* (as described in chapter 7) instantly deprives a character of their Bastion. When such an event occurs, the player can decide what terrible fate befalls the Bastion. The Bastion might be sacked by enemies or destroyed by an earthquake, for example.\n\nRegardless of how the Bastion falls, the player can work with the DM to establish a new Bastion and determine how it comes into being. Use the Special Facility Acquisition table to determine how many special facilities come with it. The new Bastion also starts with two basic facilities (one Cramped and one Roomy) of the player's choice.",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 8",
    "section": "Bastions"
  }
}
