{
  "name": "Training Area",
  "slug": "training-area",
  "type": "",
  "level": "",
  "space": "Vast",
  "hirelings": "4",
  "order": "Empower",
  "description": "*Level 9 Bastion Facility*\n\n**Prerequisite:** None\n**Space:** Vast\n**Hirelings:** 4\n**Order:** Empower\n\nA Bastion can have more than one Training Area. A Training Area might be an open courtyard, a gymnasium, a music or dance hall, or a cleverly built gauntlet of traps and hazards. It might contain inanimate targets (for weapon practice), padded mats, and other equipment. One of the facility's hirelings is an expert trainer; the others serve as training partners.\n\nWhen a Training Area becomes part of your Bastion, choose one trainer from the Expert Trainers table. On each Bastion turn, you can replace that trainer with another one from the table.\n\n#### Expert Trainers\n\n| Trainer Type | Empower Effect |\n|---|---|\n| Battle Expert | When you take damage from an attack made with an Unarmed Strike or a weapon, you can take a Reaction to reduce this damage by 1d4. |\n| Skills Expert | You gain proficiency in one of the following skills of your choice: Acrobatics, Athletics, Performance, Sleight of Hand, or Stealth. |\n| Tools Expert | You gain proficiency with one tool of your choice. |\n| Unarmed Combat Expert | When you hit with your Unarmed Strike and deal damage, the attack deals an extra 1d4 Bludgeoning damage. |\n| Weapon Expert | Choose a kind of Simple or Martial weapon, such as Spear or Longbow. If you aren't proficient with the weapon, you gain proficiency with it. If you already have proficiency with the weapon, you can use its mastery property. |\n\n***Empower: Training.*** When you issue the Empower order to this facility, the facility's hirelings conduct training exercises for the next 7 days. Any character who trains here for at least 8 hours on each of those days gains a benefit at the end of the training period. The benefit depends on which trainer is present in the facility, as noted in the Expert Trainers table. The benefit lasts for 7 days.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 8",
    "section": "Bastions"
  }
}
