[
  {
    "id": "archery",
    "name": "Archery",
    "description": "You gain a +2 bonus to attack rolls you make with Ranged weapons.",
    "prerequisite": "Fighting Style feature",
    "classRestriction": null,
    "source": "phb2024"
  },
  {
    "id": "blind-fighting",
    "name": "Blind Fighting",
    "description": "You have Blindsight with a range of 10 feet. Within that range, you can effectively see anything that isn't behind Total Cover, even if you have the Blinded condition or are in Darkness. Moreover, in that range, you can see creatures that have the Invisible condition.",
    "prerequisite": "Fighting Style feature",
    "classRestriction": null,
    "source": "phb2024"
  },
  {
    "id": "defense",
    "name": "Defense",
    "description": "While you are wearing Light, Medium, or Heavy armor, you gain a +1 bonus to Armor Class.",
    "prerequisite": "Fighting Style feature",
    "classRestriction": null,
    "source": "phb2024"
  },
  {
    "id": "dueling",
    "name": "Dueling",
    "description": "When you are wielding a Melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.",
    "prerequisite": "Fighting Style feature",
    "classRestriction": null,
    "source": "phb2024"
  },
  {
    "id": "great-weapon-fighting",
    "name": "Great Weapon Fighting",
    "description": "When you roll damage for an attack you make with a Melee weapon that you are holding with two hands, you can treat any 1 or 2 on a damage die as a 3. The weapon must have the Two-Handed or Versatile property to gain this benefit.",
    "prerequisite": "Fighting Style feature",
    "classRestriction": null,
    "source": "phb2024"
  },
  {
    "id": "interception",
    "name": "Interception",
    "description": "When a creature you can see hits another creature within 5 feet of you with an attack roll, you can take a Reaction to reduce the damage dealt to the target by 1d10 + your Proficiency Bonus. You must be wielding a Shield or a Simple or Martial weapon to use this Reaction.",
    "prerequisite": "Fighting Style feature",
    "classRestriction": null,
    "source": "phb2024"
  },
  {
    "id": "protection",
    "name": "Protection",
    "description": "When a creature you can see attacks a target other than you that is within 5 feet of you, you can take a Reaction to interpose your Shield and impose Disadvantage on the attack roll. You must be wielding a Shield to use this Reaction.",
    "prerequisite": "Fighting Style feature",
    "classRestriction": null,
    "source": "phb2024"
  },
  {
    "id": "thrown-weapon-fighting",
    "name": "Thrown Weapon Fighting",
    "description": "When you hit with a ranged attack roll using a weapon that has the Thrown property, you gain a +2 bonus to the damage roll.",
    "prerequisite": "Fighting Style feature",
    "classRestriction": null,
    "source": "phb2024"
  },
  {
    "id": "two-weapon-fighting",
    "name": "Two-Weapon Fighting",
    "description": "When you make an extra attack as a result of using a weapon that has the Light property, you can add your ability modifier to the damage of that attack if you aren't already adding it to the damage.",
    "prerequisite": "Fighting Style feature",
    "classRestriction": null,
    "source": "phb2024"
  },
  {
    "id": "unarmed-fighting",
    "name": "Unarmed Fighting",
    "description": "When you hit with your Unarmed Strike and deal damage, you can deal Bludgeoning damage equal to 1d6 + your Strength modifier instead of the normal damage of an Unarmed Strike. If you aren't holding any weapons or a Shield when you make the attack roll, the d6 becomes a d8. At the start of each of your turns, you can deal 1d4 Bludgeoning damage to one creature Grappled by you.",
    "prerequisite": "Fighting Style feature",
    "classRestriction": null,
    "source": "phb2024"
  },
  {
    "id": "blessed-warrior",
    "name": "Blessed Warrior",
    "description": "You learn two Cleric cantrips of your choice. The chosen cantrips count as Paladin spells for you, and Charisma is your spellcasting ability for them. Whenever you gain a Paladin level, you can replace one of these cantrips with another Cleric cantrip.",
    "prerequisite": "Fighting Style feature",
    "classRestriction": "paladin",
    "source": "phb2024"
  },
  {
    "id": "druidic-warrior",
    "name": "Druidic Warrior",
    "description": "You learn two Druid cantrips of your choice. The chosen cantrips count as Ranger spells for you, and Wisdom is your spellcasting ability for them. Whenever you gain a Ranger level, you can replace one of these cantrips with another Druid cantrip.",
    "prerequisite": "Fighting Style feature",
    "classRestriction": "ranger",
    "source": "phb2024"
  }
]
