{
  "name": "Shadowfell",
  "slug": "shadowfell",
  "category": "transitive",
  "description": "The **Shadowfell**, also called the **Plane of Shadow**, is a gloomy dimension whose sky is a black vault with neither sun nor stars. The Shadowfell overlaps the Material Plane in much the same way as the Feywild. Aside from the bleak landscape, it appears similar to the Material Plane.\n\nTravelers from the Material Plane who enter the Shadowfell often observe landmarks similar to the world they left, but distorted and often sinister. A mountain on the Material Plane might be replaced in the Shadowfell by a skull-shaped rock outcropping, a heap of rubble, or the crumbling ruin of a once-great castle. The forests of the Shadowfell hold sinister-looking trees, their branches reaching out to snare travelers' cloaks, and their roots coiling to trip those who pass by.\n\nShadow dragons and Undead haunt this bleak plane, as do other creatures that thrive in the gloom, including cloakers and darkmantles.\n\n#### Shadow Crossings\n\n**Shadow crossings** are locations where the veil between the Material Plane and the Shadowfell is so thin that creatures can pass from one plane to the other. A blot of shadow in the corner of a dusty crypt might be a shadow crossing, as might an open grave. Shadow crossings form in gloomy places where spirits or the stench of death lingers, such as battlefields, graveyards, and tombs. They manifest only in darkness, closing as soon as they feel light's kiss.\n\n#### Domains of Dread\n\nIn a far-flung corner of the Shadowfell drifts a hidden expanse of roiling mist and vague semireality. At this eerie edge of the multiverse, mysterious entities known as the **Dark Powers** collect the most wicked beings from across ages and worlds within inescapable, mist-shrouded demiplanes. In these shadowy prisons, the villainous beings become **Darklords**, able to exercise great power but confined to realms that twist their desires, capturing them in cycles of dread and despair.\n\nMists surround each of the Domains of Dread, making it difficult to leave one domain and even harder to find a path to another. The Mists rise and fall at the whim of the Dark Powers, and they can even slip across the planes to drag people unwittingly into the dread domains. Those who live in these domains ascribe all sorts of sinister stories to the Mists—any supernatural happening, inexplicable disappearance, or malicious force can be blamed on the Mists.\n\nThe following Domains of Dread are among the most infamous. They are described in more detail in *Van Richten's Guide to Ravenloft*.\n\n**Barovia.** The towering spires of **Castle Ravenloft** loom above the valley of Barovia, which is ruled by **Strahd von Zarovich**, the first vampire.\n\n**Borca.** Amid opulent estates and impoverished villages, two Darklords—the vicious poisoner **Ivana Boritsi** and the childishly cruel stalker **Ivan Dilisnya**—pursue their obsessive schemes.\n\n**Falkovnia.** Empty countryside surrounds ruined or crumbling cities, with only a few pockets of civilization fighting a losing battle against an endless plague of zombies. General **Vladeska Drakov** commands a fierce military force that desperately clings to power.\n\n**Kalakeri.** A beautiful land of rainforests, rivers, and lakes is a quagmire of intrigue and despair as three royal heirs—transformed into monsters by their depravity and hatred—battle endlessly to claim the throne of their ancient dynasty.\n\n**Lamordia.** Inventors and scholars violate both natural and moral laws in the frozen bogs and glacial expanses of Lamordia. The worst of them is the domain's Darklord, **Doctor Viktra Mordenheim**, whose efforts to create life and abolish death have led to tragedy.\n\n**Mordent.** Death in Mordent heralds the beginning of a haunted afterlife as a restless spirit, for this domain is the realm of ghost stories and hauntings. The dead here earn no rest, no finality, no peace—just a passage into a shadow world of wispy phantoms, mournful groaning, and clanking chains.\n\n**Valachan.** The devious hunter **Chakuna** roams the jungles of her domain, hunting the most dangerous beasts she can find. When she grows dissatisfied with simpler prey, she draws people into a fatal contest, ensuring that the land remains steeped in blood.\n\n#### Shadowfell Despair\n\nA melancholic atmosphere pervades the Shadowfell, and extended forays to this plane can afflict characters with despair.\n\nWhen you deem it appropriate, though usually not more than once per day, you can require a character not from the Shadowfell to make a DC 10 Wisdom saving throw. On a failed save, the character is affected by despair. Roll on the Shadowfell Despair table to determine the effects. You can substitute different despair effects of your own creation.\n\n##### Shadowfell Despair\n\n| d6 | Effect |\n|---|---|\n| 1–3 | **Apathy.** The character has Disadvantage on Death Saving Throws and Initiative rolls. |\n| 4–5 | **Dread.** The character has Disadvantage on all saving throws. |\n| 6 | **Delusion.** The character has Disadvantage on ability checks and saving throws that use Intelligence, Wisdom, or Charisma. |\n\nIf a character is already suffering a despair effect and fails the saving throw, the new despair effect replaces the old one. After finishing a Long Rest, a character can attempt to overcome the despair with a DC 15 Wisdom saving throw. (The DC is higher because it's harder to shake off despair once it has taken hold.) On a successful save, the despair effect ends for that character. A *Calm Emotions* spell or magic that removes curses cures the despair.\n\n#### Shadowfell Adventures\n\nThe Shadowfell is a realm of death, gloom, and dread. Adventures here can involve encounters with Undead, explorations of distorted mirror-landscapes, and descents into the mist-shrouded Domains of Dread where escape seems impossible and horror lurks around every corner.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
