{
  "name": "Elf",
  "description": "Created by the god Corellon, the first elves could change their forms at will. They lost this ability when Corellon cursed them for plotting with the deity Lolth, who tried and failed to usurp Corellon's dominion. When Lolth was cast into the Abyss, most elves renounced her and earned Corellon's forgiveness, but that which Corellon had taken from them was lost forever.\n\nNo longer able to shape-shift at will, the elves retreated to the Feywild, where their sorrow was deepened by that plane's influence. Over time, curiosity led many of them to explore other planes of existence, including worlds in the Material Plane.\n\nElves have pointed ears and lack facial and body hair. They live for around 750 years, and they don't sleep but instead enter a trance when they need to rest. In that state, they remain aware of their surroundings while immersing themselves in memories and meditations.\n\nAn environment subtly transforms elves after they inhabit it for a millennium or more, and it grants them certain kinds of magic. Drow, high elves, and wood elves are examples of elves who have been transformed thus.",
  "creatureType": "Humanoid",
  "size": {
    "type": "fixed",
    "value": "Medium"
  },
  "speed": 30,
  "darkvision": 60,
  "traits": [
    {
      "name": "Darkvision",
      "description": "You have Darkvision with a range of 60 feet."
    },
    {
      "name": "Elven Lineage",
      "description": "You are part of a lineage that grants you supernatural abilities. Choose a lineage from the Elven Lineages table. You gain the level 1 benefit of that lineage.",
      "lineageChoices": {
        "label": "Elven Lineage",
        "spellcastingAbility": {
          "type": "choice",
          "options": ["Intelligence", "Wisdom", "Charisma"]
        },
        "options": [
          {
            "name": "Drow",
            "description": "The range of your Darkvision increases to 120 feet. You also know the *Dancing Lights* cantrip.",
            "darkvisionOverride": 120,
            "cantrips": ["Dancing Lights"],
            "leveledSpells": [
              {
                "spell": "Faerie Fire",
                "requiredCharacterLevel": 3,
                "oncePerLongRestWithoutSlot": true
              },
              {
                "spell": "Darkness",
                "requiredCharacterLevel": 5,
                "oncePerLongRestWithoutSlot": true
              }
            ]
          },
          {
            "name": "High Elf",
            "description": "You know the *Prestidigitation* cantrip. Whenever you finish a Long Rest, you can replace that cantrip with a different cantrip from the Wizard spell list.",
            "cantrips": ["Prestidigitation"],
            "leveledSpells": [
              {
                "spell": "Detect Magic",
                "requiredCharacterLevel": 3,
                "oncePerLongRestWithoutSlot": true
              },
              {
                "spell": "Misty Step",
                "requiredCharacterLevel": 5,
                "oncePerLongRestWithoutSlot": true
              }
            ]
          },
          {
            "name": "Wood Elf",
            "description": "Your Speed increases to 35 feet. You also know the *Druidcraft* cantrip.",
            "speedOverride": 35,
            "cantrips": ["Druidcraft"],
            "leveledSpells": [
              {
                "spell": "Longstrider",
                "requiredCharacterLevel": 3,
                "oncePerLongRestWithoutSlot": true
              },
              {
                "spell": "Pass without Trace",
                "requiredCharacterLevel": 5,
                "oncePerLongRestWithoutSlot": true
              }
            ]
          }
        ]
      }
    },
    {
      "name": "Fey Ancestry",
      "description": "You have Advantage on saving throws you make to avoid or end the Charmed condition."
    },
    {
      "name": "Keen Senses",
      "description": "You have proficiency in the Insight, Perception, or Survival skill."
    },
    {
      "name": "Trance",
      "description": "You don't need to sleep, and magic can't put you to sleep. You can finish a Long Rest in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness."
    }
  ],
  "lifespan": 750,
  "source": "PHB 2024"
}
