{
  "name": "Create Undead",
  "level": 6,
  "school": "Necromancy",
  "classes": ["Cleric", "Warlock", "Wizard"],
  "ritual": false,
  "castingTime": {
    "type": "Time",
    "timeAmount": 1,
    "timeUnit": "minutes",
    "ritual": false
  },
  "range": {
    "type": "Ranged",
    "distance": 10,
    "unit": "feet"
  },
  "components": {
    "verbal": true,
    "somatic": true,
    "material": {
      "description": "one 150+ GP black onyx stone for each corpse",
      "cost": 150,
      "currency": "GP",
      "consumed": false
    }
  },
  "duration": {
    "type": "Instantaneous",
    "concentration": false
  },
  "description": "You can cast this spell only at night. Choose up to three corpses of Medium or Small Humanoids within range. Each one becomes a Ghoul under your control. As a Bonus Action on each of your turns, you can mentally command any creature you animated with this spell if the creature is within 120 feet of you (if you control multiple creatures, you can command any of them at the same time, issuing the same command to them). You decide what action the creature will take and where it will move on its next turn, or you can issue a general command, such as to guard a particular place. If you issue no commands, the creature takes the Dodge action and moves only to avoid harm. Once given an order, the creature continues to follow the order until its task is complete. The creature is under your control for 24 hours, after which it stops obeying any command you've given it. To maintain control of the creature for another 24 hours, you must cast this spell on the creature before the current 24-hour period ends. This use of the spell reasserts your control over up to three creatures you have animated with this spell rather than animating new ones.",
  "targetCount": 3,
  "targetType": "corpse",
  "summonsCreature": {
    "statBlockName": "Ghoul",
    "creatureType": "Undead",
    "count": 3,
    "scalesWithSpellLevel": true,
    "description": "Each corpse of a Medium or Small Humanoid becomes a Ghoul under your control for 24 hours. Control can be reasserted by recasting the spell before the 24-hour period ends."
  },
  "subsequentTurnAction": {
    "actionType": "BonusAction",
    "description": "You can mentally command any creature you animated with this spell if the creature is within 120 feet of you, issuing the same command to each one. You decide what action the creature will take and where it will move on its next turn, or you can issue a general command."
  },
  "higherLevelCasting": {
    "overrides": [
      {
        "minSlotLevel": 7,
        "maxSlotLevel": 7,
        "description": "You can animate or reassert control over four Ghouls."
      },
      {
        "minSlotLevel": 8,
        "maxSlotLevel": 8,
        "description": "You can animate or reassert control over five Ghouls or two Ghasts or Wights."
      },
      {
        "minSlotLevel": 9,
        "maxSlotLevel": 9,
        "description": "You can animate or reassert control over six Ghouls, three Ghasts or Wights, or two Mummies."
      }
    ]
  },
  "tags": ["summoning", "undead", "control", "night-only", "corpse-required"]
}
