{
  "name": "Abyss",
  "slug": "abyss",
  "category": "outer",
  "description": "The Abyss embodies all that is perverse, gruesome, and chaotic. Its virtually endless layers spiral downward into ever more appalling forms. Each layer of the Abyss boasts a horrific environment that is harsh and inhospitable to mortals. Each layer also reflects the entropic nature of the Abyss. Much of the plane seems to be in a decaying, crumbling, or corroded state, and its corruption affects visitors (see \"Curses and Magical Contagions\" in chapter 3).\n\n#### Layers of the Abyss\n\nThe layers of the Abyss are numbered based on the sequence of their discovery and cataloging by explorers from **Sigil**. Thus, the **Plain of Infinite Portals** is identified as the first layer, **Azzagrat** encompasses the 45th, 46th, and 47th layers; the **Demonweb** is the 66th layer; and so on. The Layers of the Abyss table presents several infamous layers; detailed descriptions of these layers follow the table.\n\n| Layer | Description |\n|---|---|\n| The Plain of Infinite Portals | On layer 1, corroded iron fortresses defend routes to lower layers. |\n| Azzagrat | **Graz'zt's** corrupt, decadent city is split across layers 45, 46, and 47. |\n| The Demonweb | On layer 66, **Lolth's** web snares all and hides portals to other planes. |\n| Gaping Maw | Layer 88 is a malevolent wilderness surrounding **Demogorgon's** ocean fortress. |\n| Thanatos | On layer 113, an endless graveyard hosts **Orcus** and the sleepless dead. |\n| The Slime Pits (Shedaklah) | Layer 222, a fetid realm of ooze and fungi, obeys the whims of **Juiblex** and **Zuggtmoy**. |\n| The Death Dells | **Yeenoghu** and his gnoll servants prowl layer 422—a cruel, desolate realm. |\n| The Endless Maze | Layer 600's endless labyrinth turns visitors into **Baphomet's** prey. |\n\n**Layer 1: The Plain of Infinite Portals.** This layer is the miserable gateway to the infinite layers of the Abyss. Under a glaring red sun, the rocky ground contains gaping craters that are portals to the other layers of the Abyss. Other portals lead to Pandemonium, Sigil, the gate-town of **Plague-Mort** in the Outlands, and the Astral Plane, making this layer the best way to escape the horrors of the Abyss. Iron fortresses dot the landscape, homes to petty lords and upstart demons that are as changeable as the Abyss itself. The portal leading to Plague-Mort is tucked within a fortress called the **Broken Reach**, ruled by a succubus named **Red Shroud**. In the Broken Reach, those who can prove their strength and mettle can stay unharmed for a few days at least.\n\n**Layers 45–47: Azzagrat.** The demon lord **Graz'zt** embodies manipulation and cruelty, tempting mortals with the promise of appalling delights and decadent luxuries. He rules over the realm of **Azzagrat**, which encompasses three interconnected layers of the Abyss. His seat of power is the fantastic **Argent Palace** in the city of **Zelatar**, whose bustling markets and pleasure palaces draw visitors from across the multiverse in search of obscure magical lore and perverse delights. By Graz'zt's command, the demons of Azzagrat present a veneer of civility and courtly comity. However, the so-called **Triple Realm** holds as much danger as any other part of the Abyss, and planar visitors can vanish without a trace in its mazelike cities and in forests whose trees have serpents for branches.\n\n**Layer 66: The Demonweb.** **Lolth** is the Demon Queen of Spiders, whose schemes entangle entire civilizations on worlds across the multiverse. Of all demon lords, she might have the most active interest in the worlds of the Material Plane and in the cultists who do her bidding on those worlds, but her interest lies only in domination. Lolth's layer is an immense network of thick, magical webbing that forms passageways and cocoon-like chambers. Structures, ships, and other objects are caught in the webbing. The webs conceal random portals that snare objects from demiplanes and Material Plane worlds that figure into the schemes of the Spider Queen. Lolth's servants also build dungeons amid the webbing, trapping and hunting Lolth's hated enemies within crisscrossing corridors of web-mortared stone. Far beneath these dungeons lie the bottomless **Demonweb Pits** where the Spider Queen dwells with her most loyal servants—yochlol demons created to serve her that outrank mightier demons while in the Spider Queen's realm.\n\n**Layer 88: The Gaping Maw.** The Sibilant Beast and the self-styled Prince of Demons, **Demogorgon** yearns for nothing less than undoing the order of the multiverse. A two-headed monster who seems as much in conflict with himself as with other beings, the Prince of Demons inspires fear and hatred among other demons and demon lords. Demogorgon's layer is a vast wilderness of brutality and horror known as the **Gaping Maw**, where even powerful demons are overcome by fear. Reflecting Demogorgon's dual nature, the Gaping Maw consists of a massive primeval continent covered in dense jungle, surrounded by a seemingly endless expanse of ocean and brine flats. The Prince of Demons rules his layer from two serpentine towers, which emerge from a turbid sea. Each tower is topped with an enormous fanged skull. The spires constitute the fortress of **Abysm**, where echoes of Demogorgon's turbulent thoughts resound through the halls, tearing at the minds of creatures who dare to enter.\n\n**Layer 113: Thanatos.** Known as the Demon Prince of Undeath and the Blood Lord, the demon lord **Orcus** is worshiped by Undead and by living creatures that channel the power of undeath. A brooding and nihilistic entity, Orcus yearns to make the multiverse a place of death and despair, forever unchanging except by his will, and to turn all creatures into Undead under his control. Orcus's realm of **Thanatos** is a land of bleak mountains, barren moors, ruined cities, and forests of twisted black trees under a black sky. Tombs, mausoleums, gravestones, and sarcophagi litter the landscape. Undead swarm across the plane, bursting from their tombs and graves to tear apart any creatures foolish enough to journey here. Orcus rules Thanatos from a vast palace known as **Everlost**, crafted of obsidian and bone. Set in a howling wasteland called **Oblivion's End**, the palace is surrounded by tombs and graves dug into the sheer slopes of narrow valleys, creating a tiered necropolis.\n\n**Layer 222: The Slime Pits.** Also known as **Shedaklah**, this layer is ruled by two separate yet equally repugnant demon lords—**Juiblex** and **Zuggtmoy**—who coexist with little conflict. Juiblex, the Demon Lord of Slimes and Oozes, is an amorphous mass that lurks in the abyssal depths. The wretched Faceless Lord cares nothing for cultists or mortal servants, and its sole desire is to turn all creatures into formless copies of its horrid self. Zuggtmoy is the Demon Queen of Fungi and the Lady of Rot and Decay. Her primary desire is to infect the living with spores, transforming them into her servants and, eventually, into decomposing hosts for the mushrooms, molds, and other fungi that she spawns. As the name suggests, the Slime Pits is a bubbling morass of fetid sludge. The landscape is covered in vast expanses of caustic slimes, and strange organic forms rise from the oceans of ooze at Juiblex's command. Zuggtmoy's palace consists of two dozen immense mushrooms, among the largest in existence, hollowed into grand chambers and twisting corridors. The palace is surrounded by a field of acidic puffballs and poisonous vapors.\n\n**Layer 422: The Death Dells.** The demon lord **Yeenoghu** hungers for slaughter and senseless destruction. Gnolls are his instruments on the Material Plane, and he drives them to ever-greater atrocities in his name. Delighting in sorrow and hopelessness, the Gnoll Lord yearns to turn the cosmos into a wasteland in which the last surviving gnolls tear one another apart for the right to feast upon the dead. Yeenoghu rules a layer of ravines and badlands known as the **Death Dells**. Here, creatures must hunt to survive. Even plants try to snare the unwary to bathe their roots in blood. Yeenoghu's servants, helping to sate their master's hunger as he prowls his kingdom, capture creatures from the Material Plane for release in the Gnoll Lord's realm.\n\n**Layer 600: The Endless Maze.** The demon lord **Baphomet**, also known as the Horned King and the Prince of Beasts, embodies bestial bloodlust. If he had his way, civilization would crumble and all mortals would embrace their predatory instincts. Baphomet's layer is a never-ending dungeon with the Horned King's enormous palace at its center. A confusing jumble of crooked hallways and myriad chambers, the palace is surrounded by a mile-wide moat concealing a confounding series of submerged stairs and tunnels leading deeper into the fortress.\n\n#### Abyss Adventures\n\nThe Abyss embodies the loathsome corruption of chaos and evil. A descent into the Abyss is a journey into a hostile and uncharted environment. It's also an opportunity to confront the evil in one's own heart and to resist the temptation to turn against allies in order to survive. Heroic characters might make a desperate last stand against endless hordes of demons here, or they might try to avoid detection while seeking a holy relic left behind by some lost hero who dared to venture here.\n\nIt's the nature of the Abyss to contaminate the other planes it touches. Opening a portal to the Abyss from any other plane allows the Abyss to create tiny pockets of Abyssal evil that can eventually become so corrupted that they're drawn into the Abyss. Thus, adventurers exploring a desecrated temple or fetid swamp on the Material Plane can unexpectedly find themselves in a demon-infested environment very much like the Abyss without ever leaving their home plane.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
