{
  "name": "Acheron",
  "slug": "acheron",
  "category": "outer",
  "description": "Acheron is made of immense iron blocks whose metallic surfaces ring beneath the marching feet of endless armies. These blocks drift through an airy void, sometimes colliding with a fearsome clang, crushing all between them and sending shudders through the plane. Acheron has four layers, with the largest blocks gravitating to the top layer.\n\nSome scholars have theorized that the crashing blocks of the upper layers are eventually broken down into smaller chunks of matter that sink to the lower layers. The truth is actually the opposite: the tiny shards of **Ocanthus**, the lowest layer, break off from an icy mire in its deepest recesses and are gradually assembled and organized, perhaps under the influence of nearby **Mechanus**, into the perfect cubes of **Avalas**.\n\nThe nature of Acheron instills bloodlust in those who visit the plane (see \"Environmental Effects\" in chapter 3).\n\n#### Layers of Acheron\n\n| Layer | Description |\n|---|---|\n| Avalas | Spirit soldiers wage endless wars across debris-strewn battlefields. |\n| Thuldanin | Pitted, hollow cubes are filled with the cast-off machinery of war. |\n| Tintibulus | Jagged blocks tumble in darkness, holding frozen memories sapped by the River Styx and crystallized into fleeting images. |\n| Ocanthus | Maelstroms of razor-sharp debris swirl above a mire of black ice. |\n\n#### Acheron Adventures\n\nAcheron is a plane of enforced order, where rigid conformity leads to crushed spirits and broken hopes. The spirits here can't conceive of anyone refusing to obey the will of their commanders. They are dedicated soldiers, forever lacking a cause.\n\nA journey into Acheron is a confrontation with the bleak nihilism of unending conflict, the harsh reality of authoritarian rule, and the uncaring pressures of social conformity. It's also an opportunity for characters to grapple with the question of what they are fighting for, among armies that have forgotten how to even ask the question.\n\nOn a more literal level, an adventure in Acheron can involve preventing a villain from scavenging Thuldanin for some new horror of warfare to be unleashed on the battlefield. Or it might require retrieving a secret from the imprisoned thoughts or memories found in the blocks of Tintibulus.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
