{
  "name": "Beastlands",
  "slug": "beastlands",
  "category": "outer",
  "description": "The Beastlands is a plane of nature unbound, of forests ranging from moss-hung mangroves to snow-laden pines, of thick jungles where the branches are woven so tight that no light penetrates, of vast plains where grains and wildflowers wave in the wind with vibrant life. The plane embodies nature's wildness and beauty, but it also speaks to the animal within all living creatures—not necessarily in a fierce, predatory way but with respect to their physical substance and fundamental needs.\n\nThe spirits of the dead on the Beastlands typically take animal forms or part-animal forms (such as centaurs). Among the greatest inhabitants of this plane are the primal spirits called **animal lords**.\n\nWhenever a visitor slays a Beast native to the plane, the slayer must succeed on a DC 10 Charisma saving throw or shape-shift into the type of Beast that was slain. The creature's game statistics are replaced by the Beast's stat block, but the creature retains its alignment, personality, creature type, Intelligence score, and ability to speak. At the end of each Long Rest, the shape-shifted creature repeats the save. On a successful save, the creature returns to its true form. After three failed saves, the transformation can be undone only by a *Remove Curse* spell or similar magic.\n\n#### Layers of the Beastlands\n\n| Layer | Description |\n|---|---|\n| Krigala | The **River Oceanus** is a strong torrent flowing through this wilderness of eternal summer noon. |\n| Brux | A red sun hovers forever on the horizon as mists and streams roil through the trees in eternal twilight. |\n| Karasuthra | A pale moon provides the only light in this wilderness of eternal night. |\n\n#### Beastlands Adventures\n\nThe Beastlands embodies wild, beautiful nature and the vibrant power of life thriving in the natural world. Visitors to the plane feel invigorated and more vital—their minds more alert, their reflexes sharpened, and their strides quickened. Hunger pangs are acute, but food and drink taste better than ever before. Sleep is always deep and restful, and sleepers always awaken alert.\n\nAdventures in the Beastlands might explore the ways that good philosophies, while purporting to value life, actually devalue the physical nature of life in favor of abstract concepts of law and ethics. Characters might end up in conflict with those who dismiss animals as inferior and irrelevant forms of life.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
