{
  "name": "Carceri",
  "slug": "carceri",
  "category": "outer",
  "description": "The grim inspiration for all other prisons in existence, Carceri is a plane of desolation and despair. Its six layers hold vast bogs, fetid jungles, windswept deserts, jagged mountains, frigid oceans, and black ice. All form a miserable home for the traitors and backstabbers trapped on this prison plane.\n\n#### Layers of Carceri\n\n| Layer | Description |\n|---|---|\n| Orthrys | The **River Styx** meanders through a layer of vast bogs and quicksand. |\n| Cathrys | The stench of decay hangs over fetid jungles and scarlet plains. |\n| Minethys | Stinging sand blows in unending storms, hiding the ruins of the ancient city **Payratheon**. |\n| Colothys | Deep chasms cut between cruel mountains make foot travel nearly impossible. |\n| Porphatys | Cold, acidic oceans are fed by constant black snow. |\n| Agathys | Black ice streaked with red covers this frigid realm. |\n\n#### Prison Plane\n\nNo one can leave Carceri easily. Magical efforts to leave the plane by any spell other than *Wish* simply fail. Portals and gates that open onto the plane become one-way only. Secret passages out of the plane exist, but they are hidden and well guarded by traps and deadly monsters. And though the **River Styx** flows between Carceri and its neighbors, the passage is extremely dangerous, and ferries leading out of Carceri are both rare and expensive.\n\n#### Carceri Adventures\n\nCarceri is a sunless plane of despair, of passions and poisons, and of realm-shattering betrayals. Hatreds run like a deep, slow-moving river, and there's no telling what the flood of treachery will consume next.\n\nIt is said that prisoners can escape Carceri only by becoming stronger than whatever force imprisoned them there, but that's a difficult task on a plane whose very nature breeds despair and betrayal. The same tendency toward betrayal prevents those who are imprisoned here from working together for long toward the common goal of escape.\n\nAdventures on Carceri might explore the forces—spiritual and psychological as well as physical and outright demonic—that keep characters trapped or imprisoned there. Characters might help a prisoner escape, from an unjustly held spirit to some primeval god banished to oblivion here.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
