{
  "name": "Elysium",
  "slug": "elysium",
  "category": "outer",
  "description": "Elysium is home to creatures of unfettered kindness and a refuge for planar travelers seeking a safe haven. The plane's bucolic landscapes glimmer with life and beauty.\n\nThe **River Oceanus** originates in the lowest layer of Elysium, **Thalasia**, and flows through the plane's layers before cascading onward to the Beastlands. Though illustrations of the plane's layers seem to show the river flowing \"up\" from each layer to the one \"above\" it, the experience of passing from one layer to another on the river is no more dramatic than weathering rapids on any ordinary river. Along its course, the great river splits into myriad smaller flows, recombines, and splits again.\n\n#### Layers of Elysium\n\n| Layer | Description |\n|---|---|\n| Amoria | Small towns on the banks of the River Oceanus, surrounded by lush meadows, are among the most hospitable refuges on the Outer Planes. |\n| Eronia | Steep hills, craggy mountains, and white granite valleys offer a rugged home for hardy souls. |\n| Belierin | Lighthouses pierce the fog and form hubs for small communities amid sprawling marshlands. |\n| Thalasia | The **Heroic Isles**, rising from the headwaters of the River Oceanus, hold the best departed souls. |\n\n#### Elysium Adventures\n\nTranquility and contentment seep into the bones and souls of those who enter Elysium. The longer a visitor remains on the plane, the less reason they find to ever leave.\n\nAn adventure in Elysium can challenge characters' devotion to doing good by offering them the opportunity (or the temptation) to rest from their labors and enjoy a well-earned reward.\n\n**Belierin** is said to be the prison of some deadly creature. Some tales say it's a powerful titan, perhaps the tarrasque, while others claim it's a deposed duke of the Nine Hells, a banished elemental prince, or even a near-dead deity. Evil creatures sometimes lurk in the marshes, seeking to free the prisoner or claim some power from it.\n\nCharacters might also venture to Elysium to seek out some ancient spirit on the **Heroic Isles**. When faced with the once-a-millennium task of forestalling a prophesied disaster, characters might consult with the valorous knight who accomplished the deed a thousand years ago.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
