{
  "name": "Hades",
  "slug": "hades",
  "category": "outer",
  "description": "The layers of Hades are called the **Three Glooms**—places without joy, hope, or passion. A gray land with an ashen sky, Hades is the destination of many souls that are unclaimed by gods or Fiends. These souls become **larvae** and spend eternity in this place, which lacks a sun, a moon, stars, or seasons. Leaching away color and emotion, the gloom on this plane is more than most visitors can stand.\n\n#### Layers of Hades\n\n| Layer | Description |\n|---|---|\n| Oinos | A land of dead-gray ash, stunted trees, and virulent disease is stalked by roving bands of Fiends looking for a fight or recruits for the **Blood War**. |\n| Niflheim | Gray pine trees blanket rolling hills and rocky bluffs, and thick mists coil around their trunks. |\n| Pluton | Shriveled willows, olive trees, and poplars contribute to the gloom of this concentration of the deepest despair in the multiverse. |\n\n#### Plane of Gloom\n\nAt the end of each Long Rest taken on the plane, a visitor makes a DC 10 Wisdom saving throw. On a failed save, the creature gains 1 Exhaustion level that can't be removed while the creature is in Hades. If the creature reaches 6 Exhaustion levels, it doesn't die. Instead, it permanently transforms into a **Larva**, whereupon all Exhaustion levels afflicting the creature are removed.\n\n#### Hades Adventures\n\nHades embodies despair manifested as apathy. Pure, undiluted evil is like an inescapable force of gravity, dragging all creatures down—not in body, but in spirit. Even the consuming rage of the Abyss and the devious plotting of the Nine Hells are subjugated to hopelessness in the **Gray Wastes** of Hades. The plane slowly kills dreams and desires, draining hope and optimism from formerly fiery spirits.\n\nAn adventure in Hades can challenge characters to find an answer to the ever-present question that hangs over this plane: why bother? As apathetic despair saturates their hearts and spirits, they must find a way to rekindle the passion of life and the sense of purpose that drives them or else succumb to the hopelessness of the plane.\n\nAdventurers might pursue a hag, a lich, or another evil spellcaster who comes to Hades to collect larvae for vile purposes. Once they are in the Three Glooms, the adventurers risk becoming trapped by the overwhelming despair of the place.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
