{
  "name": "Mount Celestia",
  "slug": "mount-celestia",
  "category": "outer",
  "description": "The **Seven Heavens** of Mount Celestia rise like a mountain from a shining **Silver Sea** to utterly incomprehensible heights, with seven plateaus marking its seven heavenly layers. The plane is the model of justice and order, of celestial grace and endless mercy, where angels and champions of good guard against incursions of evil. It is one of the few places on the planes where travelers can let down their guard. Its inhabitants strive constantly to be as righteous as possible. Countless creatures aim to reach the highest and most sublime peak of the mountain, but only the purest souls can. That peak fills even the most jaded of travelers with awe.\n\nThe pervasive goodness of Mount Celestia bestows blessings on creatures on the plane (see \"Environmental Effects\" in chapter 3).\n\n#### Layers of Mount Celestia\n\n| Layer | Description |\n|---|---|\n| Lunia | In the **Silver Heaven**, the holy water of the Silver Sea laps at the base of the celestial mountain under a starry sky. |\n| Mercuria | The **Golden Heaven's** tame slopes and lush valleys are bathed in golden light that evokes the hope of a new dawn. |\n| Venya | In the **Pearly Heaven**, terraced fields and tended woodlands dot the snowy slopes. |\n| Solania | In the **Crystal Heaven**, holy shrines glitter under a silvery sky amid luminescent fog. |\n| Mertion | On the sweeping plains of the **Platinum Heaven**, holy soldiers muster in grand citadels for battles across the planes. |\n| Jovar | The **Glittering Heaven**, strewn with beautiful rubies and garnets, is home to the seven-tiered **Heavenly City**. |\n| Chronias | The **Illuminated Heaven** is an ineffable mystery. |\n\n#### Mount Celestia Adventures\n\nThe plane of ultimate law and good is sometimes imagined to be the most boring place in the multiverse, but in truth Mount Celestia's nature makes it the target of unrelenting attacks by evil forces. The devils of the Nine Hells, in particular, long to corrupt the goodness of the Seven Heavens. The yugoloths of the Lower Planes covet the wealth of the plane, particularly the mines of Solania and the scattered gems of Jovar. And the demons of the Abyss would like nothing better than to smear their filth on the gleaming purity of Mount Celestia.\n\nBut while Fiends of all sorts launch doomed assaults on the shores of Lunia, evil's true foothold on the plane is in the hearts of those well-meaning visitors who bring their secret shame and hidden lies to the holy mountain. An adventure in Mount Celestia is an opportunity for characters to prove themselves worthy of the many blessings it offers—or to become worthy by forswearing the selfishness, greed, and hatred that lurk in their hearts.\n\nOn the edge of a clear lake in Mertion stands the city of **Empyrea**, renowned for the healing power of its fountains and springs. Pilgrims from across the planes seek out the healers, hospitals, and restorative magic found here.",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
