{
  "name": "Quaggoth Thonot",
  "slug": "quaggoth-thonot",
  "size": "Medium",
  "type": "Monstrosity",
  "alignment": "Chaotic Neutral",
  "ac": "15",
  "initiative": "+1 (11)",
  "hp": "67",
  "hpFormula": "9d8 + 27",
  "speed": "30 ft., Climb 30 ft.",
  "abilityScores": {
    "str": 17,
    "dex": 12,
    "con": 16,
    "int": 10,
    "wis": 10,
    "cha": 10
  },
  "abilitySaves": {
    "str": 3,
    "dex": 1,
    "con": 3,
    "int": 0,
    "wis": 0,
    "cha": 0
  },
  "skills": "Athletics +5",
  "immunities": "Poison; Poisoned",
  "senses": "Darkvision 120 ft.; Passive Perception 12",
  "languages": "Undercommon",
  "cr": "3 (XP 700; PB +2)",
  "traits": [
    {
      "name": "Bloodied Fury",
      "description": "While Bloodied, the quaggoth has Advantage on attack rolls."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "description": "The quaggoth makes two Claw attacks."
    },
    {
      "name": "Claw",
      "description": "*Melee Attack Roll:* +5, reach 5 ft. *Hit:* 6 (1d6 + 3) Slashing damage plus 5 (2d4) Psychic damage."
    },
    {
      "name": "Spellcasting",
      "description": "The quaggoth casts one of the following spells, requiring no spell components and using Wisdom as the spellcasting ability (spell save DC 12):"
    }
  ],
  "bonusActions": [],
  "reactions": [
    {
      "name": "Psionic Defense (3/Day)",
      "description": "The quaggoth casts *Feather Fall* or *Shield* in response to the spell's trigger, requiring no spell components and using the same spellcasting ability as Spellcasting."
    }
  ],
  "legendaryActions": [],
  "lore": "*Unpredictable Subterranean Stalkers*\n**Habitat:** Underdark; **Treasure:** None\nBeastly hunters endemic to subterranean depths, quaggoths scrape harsh existences from the Underdark. While they can survive on bitter lichens and toxic fungi, they viciously attack anything they can make a meal of, from giant spiders to explorers. Quaggoths sometimes serve as muscle for Underdark-dwelling villains.\nQuaggoths frequently collect in small bands led by the most fearsome group member. These bands are proud and quick to hold grudges. Anyone who harms a quaggoth -- or who is suspected of doing so -- earns the enmity of that quaggoth's band regardless of reason or fault. These grudges sometimes extend to whole communities rather than individuals. Generations of quaggoths might seek revenge against a settlement's inhabitants for decades-old slights. Only the leader of a quaggoth band can demand that a grudge ends.\nFor quaggoths, every fight means life or death. They battle with wild fury and do anything to survive.\nQuaggoth thonots possess psionic abilities, which they use to give themselves an edge in combat and to coerce the service of other quaggoths.",
  "habitat": "Underdark",
  "treasure": "None",
  "source": {
    "book": "2025 Monster Manual",
    "section": "Humanoids",
    "file": "Humanoids.md"
  }
}
