{
  "name": "Elemental Plane of Earth",
  "slug": "elemental-plane-of-earth",
  "category": "inner",
  "description": "The Plane of Earth is a chain of mountains rising higher than any mountain range on the Material Plane. It has no sun of its own, and no air surrounds the peaks of its highest mountains. Most visitors to the plane arrive by way of vast caverns that honeycomb the mountains.\n\nImportant features of the Plane of Earth include the following:\n\n**City of Jewels.** The plane's largest cavern, called the **Great Dismal Delve** or the **Sevenfold Mazework**, is home to the **City of Jewels**—the capital city of the dao. The dao take great pride in their wealth and send teams across the plane in search of new veins of ore and gemstones. Thanks to these expeditions, every building and significant object in the city is made from precious stones and metals, including the slender gemstone-inlaid spires that top most buildings. The city is protected by a powerful spell that alerts the entire population if a visitor steals even a single stone.\n\n**Furnaces.** The **Furnaces** are the mountains nearest the Para-elemental Plane of Magma. Lava seeps through their caverns, and the air reeks of sulfur. The dao have great forges and smelting furnaces here to process ores and shape precious metals.\n\n**Mud Hills.** The **Mud Hills** abut the swampy Para-elemental Plane of Ooze. Landslides wear away the slopes of the hills, sending cascades of earth and stone into the bottomless swamp. The Plane of Earth constantly regenerates the land, pushing new hills up as the old ones erode to nothing.\n\n#### Plane of Earth Adventures\n\nEarth symbolizes stability, rigidity, stern resolve, and tradition. The plane's position opposite the Plane of Air in the ring of the Elemental Planes reflects its opposition to almost everything air represents.\n\nElemental Evil views earth instead as an implacable force of destruction, perfectly willing to crush venerable institutions and respected traditions in its advance. Cultists of Evil Earth crave the power to destroy the works of civilization with landslides, sinkholes, or mighty earthquakes, and they believe the earth thirsts for the blood of those who don't venerate it properly.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
