{
  "name": "Elemental Plane of Air",
  "slug": "elemental-plane-of-air",
  "category": "inner",
  "description": "The Elemental Plane of Air is home to constant winds of varying strength. Here and there, chunks of earth drift in the openness, many covered with lush vegetation. These earth motes serve as homes for djinn and other natives of the plane. Other creatures live on cloud banks infused with magic to become solid surfaces, supporting towns and castles.\n\nDrifting clouds can obscure visibility in any direction in the plane. Storms are frequent, ranging from strong thunderstorms to fierce tornadoes or mighty hurricanes. The air is mild, except near the Para-elemental Planes at either end of the plane, where the temperature is more extreme. Rain and snow fall only in the part of the plane nearest to the Para-elemental Plane of Ice.\n\nAlthough few landmarks distinguish one area of the Plane of Air from any other, the following are notable features of the plane:\n\n**Aaqa.** Here and there are hidden realms reachable only by following a particular sequence of flowing winds. Fabled **Aaqa** is one such realm, a shining domain of silver spires and verdant gardens atop a fertile earth mote. The **Wind Dukes of Aaqa** are dedicated to law and good, and they maintain a vigilant watch against the depredations of Elemental Evil. They are served by aarakocra.\n\n**Labyrinth Winds.** Much of the Plane of Air is a complex web of air streams, currents, and winds called the **Labyrinth Winds**. These range from stiff breezes to howling gales that can rip a creature apart. Even the most skilled flying creatures must navigate these currents carefully, flying with the winds, not against them.\n\n**Mistral Reach.** Located near the Para-elemental Plane of Ice, the **Mistral Reach** is a region of frigid winds and driving snowstorms. Earth motes in the reach are covered with snow and ice.\n\n**Sirocco Straits.** The **Sirocco Straits** is the region of the plane nearest to the Para-elemental Plane of Ash, where hot, dry winds scour earth motes into barren chunks of rock.\n\n#### Plane of Air Adventures\n\nThe essential nature of air is movement, animation, and inspiration. Air is the breath of life, the winds of change, the fresh breeze that clears away the fog of ignorance and the stuffiness of old ideas.\n\nWhen turned toward wicked ideals by cultists of Elemental Evil, elemental air represents destructive power turned to vengeful ends. Cultists of Evil Air wield howling storms to forcefully express their personal freedom or lay claim to things they feel they have been wrongfully denied.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
