{
  "name": "Gate",
  "level": 9,
  "school": "Conjuration",
  "classes": ["Cleric", "Sorcerer", "Warlock", "Wizard"],
  "ritual": false,
  "castingTime": {
    "type": "Action",
    "ritual": false
  },
  "range": {
    "type": "Ranged",
    "distance": 60,
    "unit": "feet"
  },
  "components": {
    "verbal": true,
    "somatic": true,
    "material": {
      "description": "a diamond worth 5,000+ GP",
      "cost": 5000,
      "currency": "GP",
      "consumed": false
    }
  },
  "duration": {
    "type": "Timed",
    "concentration": true,
    "amount": 1,
    "unit": "minutes"
  },
  "description": "You conjure a portal linking an unoccupied space you can see within range to a precise location on a different plane of existence. The portal is a circular opening, which you can make 5 to 20 feet in diameter. You can orient the portal in any direction you choose. The portal lasts for the duration, and the portal's destination is visible through it. The portal has a front and a back on each plane where it appears. Travel through the portal is possible only by moving through its front. Anything that does so is instantly transported to the other plane, appearing in the unoccupied space nearest to the portal. Deities and other planar rulers can prevent portals created by this spell from opening in their presence or anywhere within their domains. When you cast this spell, you can speak the name of a specific creature (a pseudonym, title, or nickname doesn't work). If that creature is on a plane other than the one you are on, the portal opens next to the named creature and transports it to the nearest unoccupied space on your side of the portal. You gain no special power over the creature, and it is free to act as the DM deems appropriate. It might leave, attack you, or help you.",
  "targetType": "point",
  "mustSeeTarget": true,
  "teleportation": {
    "description": "Creates a circular portal 5 to 20 feet in diameter linking an unoccupied space within range to a precise location on a different plane of existence. Travel through the front of the portal instantly transports creatures and objects to the other plane. You may also speak the true name of a specific creature on another plane; if so, the portal opens next to that creature and transports it to your side."
  },
  "tags": ["planar", "portal", "teleportation"]
}
