{
  "id": "warrior-of-shadow",
  "name": "Warrior of Shadow",
  "className": "Monk",
  "level": 3,
  "description": "Harness Shadow Power for Stealth and Subterfuge",
  "features": [
    {
      "name": "Shadow Arts",
      "level": 3,
      "description": "You can expend 1 Focus Point to cast the *Darkness* spell without spell components and see within the spell's area when you cast it with this feature. While the spell persists, you can move its area of Darkness to a space within 60 feet of yourself at the start of each of your turns. You gain Darkvision with a range of 60 feet (or the range is increased by 60 feet if you already have Darkvision). You know the *Minor Illusion* spell, and Wisdom is your spellcasting ability for it."
    },
    {
      "name": "Shadow Step",
      "level": 6,
      "description": "While entirely within Dim Light or Darkness, you can use a Bonus Action to teleport up to 60 feet to an unoccupied space you can see that is also in Dim Light or Darkness. You then have Advantage on the next melee attack you make before the end of the current turn."
    },
    {
      "name": "Improved Shadow Step",
      "level": 11,
      "description": "When you use your Shadow Step, you can expend 1 Focus Point to remove the requirement that you must start and end in Dim Light or Darkness for that use of the feature. As part of this Bonus Action, you can make an Unarmed Strike immediately after you teleport."
    },
    {
      "name": "Cloak of Shadows",
      "level": 17,
      "description": "As a Magic action while entirely within Dim Light or Darkness, you can expend 3 Focus Points to shroud yourself with shadows for 1 minute, until you have the Incapacitated condition, or until you end your turn in Bright Light. While shrouded, you have the Invisible condition, you can move through occupied spaces as if they were Difficult Terrain (and are shunted to the last unoccupied space you were in if you end your turn in such a space), and you can use your Flurry of Blows without expending any Focus Points."
    }
  ]
}
