{
  "name": "Elemental Plane of Water",
  "slug": "elemental-plane-of-water",
  "category": "inner",
  "description": "The Plane of Water is an endless sea, called the **Sea of Worlds**, dotted with atolls and islands that rise up from enormous coral reefs that seem to stretch forever into the depths. The storms that move across the sea sometimes create temporary portals to the Material Plane and draw ships into the Plane of Water. Surviving vessels from countless worlds and navies ply these waters with little hope of ever returning home.\n\nA warm sun arcs across the sky of the Plane of Water, seeming to rise and set from within the water at the horizon. Several times a day, the sky clouds over and releases a deluge of rain, often accompanied by spectacular shows of lightning, before clearing up again. At night, a glittering array of stars and auroras bedecks the sky.\n\nThe weather on the plane is a lesson in extremes. If the sea isn't calm, it is battered by storms. On rare occasions, a tremor in the planar firmament sends a rogue wave sweeping across the plane, swamping entire islands and driving ships down to the reefs.\n\nAny land that rises above the surface of the sea is hotly contested by the few air breathers that live on the plane. Fleets of rafts and ships lashed together serve as solid ground where nothing else is available, although most natives of the plane never break the surface of the sea and thus ignore these habitations.\n\nThe following are among the most important features of the Plane of Water:\n\n**Citadel of Ten Thousand Pearls.** The nominal emperor of the marids dwells in the **Citadel of Ten Thousand Pearls**, an opulent palace made of coral and studded with pearls. The palace is the glittering centerpiece of the Sea of Light (see below). Visitors are welcome to ask favors of the emperor, whose mood is as changeable as the sea.\n\n**Darkened Depths.** The deeper extents of the plane, where no sunlight reaches, are called the **Darkened Depths**. Horrid creatures dwell here, and the absolute cold and crushing pressure mean a swift end to creatures accustomed to the surface or the Sea of Light. Krakens and other mighty leviathans claim this realm.\n\n**Isle of Dread.** One of the few islands on the plane is the **Isle of Dread**, which is connected to the Material Plane by means of a storm that regularly sweeps over the island. Ships from different worlds of the Material Plane end up wrecked on the rocks and reefs around the island, and settlements across the island are populated by the descendants of sailors who never found a way home. Theoretically, travelers who understand the workings of the storm could use it to travel to a desired Material Plane world.\n\n**Sea of Ice.** Bordering the Para-elemental Plane of Ice is the **Sea of Ice**. The frigid water is choked with icebergs and sheet ice, which are inhabited by cold-loving creatures from the Plane of Ice. Drifting icebergs can carry these creatures farther into the Plane of Water to threaten ships and islands in warmer seas.\n\n**Sea of Light.** Life flourishes in the sunlit waters of the **Sea of Light**, located in the upper reaches of the Sea of Worlds. Aquatic peoples craft castles and fortresses in the coral reefs here.\n\n**Silt Flats.** The region of the Plane of Water nearest to the Para-elemental Plane of Ooze is called the **Silt Flats**. The water is thick with soil and sludge, turning into muddy ground before giving way to the great swamp that is the Para-elemental Plane.\n\n#### Elemental Water Adventures\n\nThe nature of water is to flow, not like the gusting wind or the leaping flame, but smoothly and steadily. It is the rhythm of the tide, the nectar of life, the bitter tears of mourning, and the balm of sympathy and healing. Given time, it can erode all in its path.\n\nElemental Evil emphasizes the erosive power of water, as well as the destruction wrought by surging tides, deadly maelstroms, and raging torrents. Cultists of Evil Water believe the seas and deep waters are eager to reclaim the water trapped in the bodies of living creatures, and think it's their duty to return others to the primal waters by drowning them or shedding their blood.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
