{
  "name": "Tree Blight",
  "slug": "tree-blight",
  "size": "Huge",
  "type": "Plant",
  "alignment": "Neutral Evil",
  "ac": "15",
  "initiative": "+3 (13)",
  "hp": "115",
  "hpFormula": "10d12 + 50",
  "speed": "30 ft.",
  "abilityScores": {
    "str": 23,
    "dex": 10,
    "con": 20,
    "int": 10,
    "wis": 10,
    "cha": 10
  },
  "abilitySaves": {
    "str": 6,
    "dex": 0,
    "con": 5,
    "int": 0,
    "wis": 0,
    "cha": 0
  },
  "immunities": "Deafened",
  "senses": "Blindsight 60 ft.; Passive Perception 10",
  "languages": "Understands Common and Druidic but can't speak",
  "cr": "7 (XP 2,900; PB +3)",
  "traits": [],
  "actions": [
    {
      "name": "Multiattack",
      "description": "The blight makes two Branch attacks and uses Grasping Root."
    },
    {
      "name": "Branch",
      "description": "*Melee Attack Roll:* +9, reach 15 ft. *Hit:* 16 (3d6 + 6) Bludgeoning damage."
    },
    {
      "name": "Grasping Root",
      "description": "*Strength Saving Throw:* DC 17, one Large or smaller creature the blight can see within 15 feet. *Failure:* The target is pulled up to 10 feet straight toward the blight and has the Grappled condition (escape DC 16) from one of six roots. Until the grapple ends, the target takes 13 (2d6 + 6) Bludgeoning damage at the start of each of its turns."
    }
  ],
  "bonusActions": [
    {
      "name": "Gnash",
      "description": "*Dexterity Saving Throw:* DC 17, one creature Grappled by the blight. *Failure:* 19 (3d8 + 6) Piercing damage. *Success:* Half damage."
    }
  ],
  "reactions": [],
  "legendaryActions": [],
  "lore": "*Plants Sprouted from Evil*\n**Habitat:** Forest; **Treasure:** None\nBlights are malicious plants that sprout from deep-rooted evil. Their gnarled forms twist with fearsome features suggestive of human limbs and vicious maws. Blights lurk in ambush amid mundane vegetation and lash out at non-Plant creatures. While blights can act independently, they're usually motivated by whatever sinister forces spawned them or by wicked creatures with control over nature. The magic that creates blights often affects other vegetation as well, causing brambles, vines, and gnarled trees to overwhelm roads and fields, choke wells and streams, and force animals from their natural habitat. This might make blights the first sign of an oncoming wave of corruption.\nResembling bundles of sticks or dead brush, twig blights easily blend in among deadwood, flotsam, and the wood piles common in many rural settings. Groups of them are often found near river crossings, forgotten wells, or natural campsites, where they ambush those who let down their guard.\nNeedle blights have vaguely bipedal forms, with gaunt, misshapen limbs. Whether standing unnaturally still or lurching with their awkward gaits, these blights can't pass as either normal plants or woodland travelers. Once they spot foes, needle blights attack using their thorn-covered claws or by rapidly growing and flinging volleys of serrated, needlelike projectiles.\nVine blights resemble humans wrapped in vines common to the areas in which they grow, from hairy ivy vines to flowering kudzu. They can cause plants to burst from the ground around themselves and entangle nearby foes.\nUnlike most other blights, vine blights can speak. They do so rarely, typically only to convey messages from their masters or to repeat the words of their victims in rasping voices.\nTree blights look like ancient, dead trees with gnarled limbs and splintered hollows. Imbued with bloodlust, these blights feed on the living. Evidence of their past meals is often tangled amid their branches and roots. Tree blights cooperate with other blights, but they attack other tree-shaped beings they encounter, such as awakened trees and treants.\nAncient plants twisted by evil, Gulthias blights feed on blood and despoil the surrounding land, often giving rise to subservient blights. These cursed plants take their name from the story of their creation; the first of their kind was a tree that grew from the stake piercing the heart of the vampire Gulthias. These blights consider all creatures either servants or fertilizer for the blights' corruption.\n> \"It lives, though it looks dead. In an age long past, someone staked a vampire to the earth on this very spot. The wooden stake was yet green and took root. And so grew the Gulthias Tree, reverberating with primal power.\" — Belak the Outcast, druid of the Twilight Grove",
  "habitat": "Forest",
  "treasure": "None",
  "source": {
    "book": "2025 Monster Manual",
    "section": "Plants",
    "file": "Plants.md"
  }
}
