[
  {
    "id": "ballista",
    "name": "Ballista",
    "ac": 15,
    "hp": 50,
    "size": "Large",
    "damage": "3d10",
    "damageType": "Piercing",
    "attackBonus": 6,
    "rangeNormal": 120,
    "rangeLong": 480,
    "description": "A Ballista is a massive crossbow that fires heavy bolts. Loading a Ballista requires the Utilize action, and aiming it requires another Utilize action. Then a crew member can take the Ballista Bolt action."
  },
  {
    "id": "cannon",
    "name": "Cannon",
    "ac": 19,
    "hp": 75,
    "size": "Large",
    "damage": "8d10",
    "damageType": "Bludgeoning",
    "attackBonus": 6,
    "rangeNormal": 600,
    "rangeLong": 2400,
    "description": "A Cannon uses gunpowder or arcane power to propel heavy iron balls at destructive speeds. A Cannon is usually attached to a wooden frame with wheels. Loading a Cannon requires the Utilize action, and aiming it requires another Utilize action. Then a crew member can take the Cannonball action."
  },
  {
    "id": "flamethrower-coach",
    "name": "Flamethrower Coach",
    "ac": 19,
    "hp": 100,
    "size": "Large",
    "damage": "4d6",
    "damageType": "Fire",
    "saveDC": 15,
    "saveAbility": "DEX",
    "areaOfEffect": "60-foot line, 5-foot wide",
    "rangeNormal": null,
    "rangeLong": null,
    "description": "Powered by magic, this iron coach has a flamethrower turret mounted atop it. The coach can accommodate up to two Medium creatures. Narrow slits in the front, sides, and back allow its occupants to see outside, granting Three-Quarters Cover. The coach is designed for a crew of two: a driver and a gunner. The driver can take the Utilize action to move and turn the coach (Speed 30 ft). The gunner can use the Flamethrower action. On a failed save, the target starts burning."
  },
  {
    "id": "keg-launcher",
    "name": "Keg Launcher",
    "ac": 15,
    "hp": 30,
    "size": "Large",
    "damage": "4d6",
    "damageType": "Poison",
    "saveDC": 15,
    "saveAbility": "CON",
    "areaOfEffect": "20-foot radius sphere",
    "rangeNormal": 30,
    "rangeLong": 300,
    "description": "A back-mounted, wooden catapult flings small kegs of toxic gas. Loading a Keg Launcher requires the Utilize action, and aiming it requires another Utilize action. Then a crew member can take the Toxic Keg action."
  },
  {
    "id": "lightning-cannon",
    "name": "Lightning Cannon",
    "ac": 19,
    "hp": 30,
    "size": "Medium",
    "damage": "4d10",
    "damageType": "Lightning",
    "attackBonus": 6,
    "rangeNormal": 300,
    "rangeLong": 1200,
    "description": "A Lightning Cannon is a small, bronze cannon inlaid with arcane runes and mounted on a heavy tripod device. It launches balls of crackling electricity. Aiming a Lightning Cannon requires the Utilize action, then a crew member can take the Lightning Ball action."
  },
  {
    "id": "mangonel",
    "name": "Mangonel",
    "ac": 15,
    "hp": 100,
    "size": "Large",
    "damage": "5d10",
    "damageType": "Bludgeoning",
    "attackBonus": 5,
    "rangeNormal": 200,
    "rangeLong": 800,
    "minimumRange": 60,
    "description": "A Mangonel is a catapult that hurls heavy projectiles in a high arc, so it can hit targets behind walls. Loading a Mangonel requires two Utilize actions, and aiming it requires two more Utilize actions. Then a crew member can take the Mangonel Stone action."
  },
  {
    "id": "ram",
    "name": "Ram",
    "ac": 15,
    "hp": 100,
    "size": "Large",
    "damage": "3d10",
    "damageType": "Bludgeoning",
    "attackBonus": 8,
    "rangeNormal": null,
    "rangeLong": null,
    "description": "A Ram consists of a movable gallery equipped with a heavy log suspended from two roof beams by chains. The log is shod in iron and used to batter through doors and barricades. Positioning a Ram requires three Utilize actions. Then a crew member can use the Ram action. The gallery roof gives the operators Total Cover against attacks and other effects from above."
  },
  {
    "id": "siege-tower",
    "name": "Siege Tower",
    "ac": 15,
    "hp": 200,
    "size": "Gargantuan",
    "damage": null,
    "damageType": null,
    "rangeNormal": null,
    "rangeLong": null,
    "description": "A Siege Tower is a mobile wooden structure with a beam frame and slats in its walls. Large wooden wheels or rollers allow the tower to be pushed or pulled by soldiers or beasts of burden. Medium or smaller creatures can use the Siege Tower to reach the top of walls up to 40 feet high. A creature in the tower has Total Cover against attacks and other effects that originate outside it."
  },
  {
    "id": "suspended-cauldron",
    "name": "Suspended Cauldron",
    "ac": 19,
    "hp": 20,
    "size": "Large",
    "damage": "3d6",
    "damageType": "Fire",
    "saveDC": 15,
    "saveAbility": "DEX",
    "areaOfEffect": "10-foot square below",
    "rangeNormal": null,
    "rangeLong": null,
    "description": "An iron pot is suspended so that it can be tipped easily, spilling its contents. Once emptied, a cauldron must be refilled before it can be used again. Filling the cauldron requires three Utilize actions. Then a crew member can take the Spill action. Cauldrons are typically filled with boiling oil but can be filled with other substances, such as acid or green slime, with different effects."
  },
  {
    "id": "trebuchet",
    "name": "Trebuchet",
    "ac": 15,
    "hp": 150,
    "size": "Huge",
    "damage": "8d10",
    "damageType": "Bludgeoning",
    "attackBonus": 5,
    "rangeNormal": 300,
    "rangeLong": 1200,
    "minimumRange": 60,
    "description": "A Trebuchet is a catapult that throws its payload in a high arc so it can hit targets behind walls. Loading a Trebuchet requires two Utilize actions, and aiming it requires two more Utilize actions. Then a crew member can take the Trebuchet Stone action."
  }
]
