{
  "name": "Arborea",
  "slug": "arborea",
  "category": "outer",
  "description": "Arborea is a plane of extremes: stupendously craggy mountains; unbelievably deep gorges; forests of monstrously huge trees; and vast stretches of wheat fields, orchards, and arbors. Wild-hearted nature spirits dwell in every glade and stream, brooking no infringement. Travelers must tread lightly.\n\nThe air of Arborea seems charged with excitement. Sudden squalls brew up out of nowhere, beating the tree-lined paths with heavy winds. The storms pass within minutes and leave behind warm flares of sunlight filtering through the forest canopy. Music always seems to be playing in the distance; sometimes it originates from groups of elf musicians, but just as often the faint tune is merely the wind curling through the boles of the great trees.\n\n#### Layers of Arborea\n\n| Layer | Description |\n|---|---|\n| Arvandor | Towering trees, colorful wildflowers, abundant grain, and delicious fruit create a lush environment. |\n| Aquallor | An eternal ocean fed by the **River Oceanus** is home to teeming sea life and mighty storms. |\n| Mithardir | A desert of white sand is abandoned by whatever powers once lived there. |\n\n#### Arborea Adventures\n\nArborea is a larger-than-life place of violent moods and deep affections, of whim backed by steel, and of passions that blaze brightly until they burn out. Its good-natured inhabitants are dedicated to fighting evil, but their reckless emotions sometimes break free with devastating consequences. Rage is as common and as honored as joy in Arborea.\n\nAn adventure in Arborea can be an opportunity for characters to discover who they are when masks fall away and the honesty of unfettered emotion is revealed. The inhabitants of the plane are accustomed to this emotional honesty. Lifelong friends might share a laugh over food and wine, cross blades over a mutual lover, and write songs celebrating each other's courage and integrity, all in a single evening. For those who aren't accustomed to this candor, though, it can lead to hurt feelings and lingering resentment.\n\nCreatures that visit Arborea and then leave sometimes experience a desperate desire to return—a yearning so intense that it can interfere with day-to-day life.\n\nWhat secrets lie buried in the sands of **Mithardir**? An expedition might involve investigating whatever gods or Celestials once inhabited the silver desert or find some knowledge they possessed.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
