{
  "name": "Arcadia",
  "slug": "arcadia",
  "category": "outer",
  "description": "Arcadia thrives with orchards of perfectly lined trees, ruler-straight streams, orderly fields, immaculate roads, and cities laid out in geometrically pleasing shapes. The mountains bear no trace of erosion.\n\nNight and day are determined by an orb that floats in the sky above both of Arcadia's layers. Half of the orb radiates sunlight and brings about the day; the other half sheds moonlight and brings on the starry night. The orb rotates evenly without fail, spreading day and night across the entire plane.\n\nThe weather in Arcadia is governed by four allied demigods called the **Storm Kings**: the **Cloud King**, the **Wind Queen**, the **Lightning King**, and the **Rain Queen**. Each one lives in a castle surrounded by the type of weather that ruler controls.\n\nArcadia is suffused with a vigorous life energy that bestows great vitality on visitors (see \"Environmental Effects\" in chapter 3).\n\n#### Layers of Arcadia\n\n| Layer | Description |\n|---|---|\n| Abellio | Everything in these fields of plenty is dedicated to the good of all. |\n| Buxenus | Military forces gather their strength, amid pleasant valleys and orchards, to reclaim the lost layer of **Menausus**—now part of Mechanus. |\n\n#### Arcadia Adventures\n\nEverything on Arcadia works toward the common good and a flawless existence. Here, purity is eternal, and nothing intrudes on harmony. Individuality is subsumed to peaceful life in community, and military might can be brought to bear on those who disrupt that peace.\n\nAn adventure in Arcadia can be an opportunity to explore the tension between individual freedom and societal responsibility for the common good. Even lawfully inclined adventurers rarely conform neatly to social expectations, and a visit to this plane can highlight that conflict.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
