{
  "name": "Gehenna",
  "slug": "gehenna",
  "category": "outer",
  "description": "A volcanic mountain dominates each of the four layers of Gehenna, and lesser volcanic earthbergs drift in the air and smash into the greater mountains. The rocky slopes of the plane make movement difficult and dangerous. The ground inclines at least 45 degrees almost everywhere. In places, steep cliffs and deep canyons present more challenging obstacles. Hazards include volcanic fissures that vent noxious fumes or searing flames.\n\nGehenna is the birthplace of **yugoloths**, greedy and selfish Fiends that dwell here in great numbers.\n\n#### Layers of Gehenna\n\n| Layer | Description |\n|---|---|\n| Khalas | Lava illuminates clouds of volcanic ash and steam from the **River Styx**. |\n| Chamada | Constant lava flows and eruptions make overland travel difficult. Iron zeppelins piloted by yugoloths drift through the constant gray ashfall. |\n| Mungoth | Acidic ash mingles with falling snow on this freezing layer. |\n| Krangath | The **Dead Furnace** is a great mountain suspended in silence and darkness, home to a coterie of liches. |\n\n#### Gehenna Adventures\n\nGehenna is the plane of suspicion and greed, with no space for mercy or compassion. Adventures on this plane might be an opportunity to explore themes of betrayal, examining how characters behave when tensions run high and they can trust no one—perhaps not even each other. (See \"Environmental Effects\" in chapter 3 for one way this atmosphere can manifest.) Characters might encounter people in need who turn out to be yugoloths in disguise, pitting the characters' growing suspicion against their empathy and compassion.\n\nCharacters might make their way to the **Teardrop Palace** on Khalas to purchase something they can't find elsewhere, probably at a terrifying cost. This bustling market, crowded with Fiends and occasional mortal visitors, offers all manner of forbidden and sinister goods for sale. Its name comes from its shape: the point is on the palace's uphill side so it diverts the ever-present lava flow to either side of the structure.\n\nOr characters could try to infiltrate the **Tower Arcane** in search of some great secret from yugoloths' ancient history. The tower, a sinister structure adorned with blades and spikes and guarded by **arcanaloths**, stands somewhere on Chamada. It is rumored to hold yugoloths' history and the records of their contracts.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
