{
  "name": "Outlands",
  "slug": "outlands",
  "category": "outer",
  "description": "The **Outlands** lies between the Outer Planes. It is the plane of neutrality, keeping all aspects of the planes in a paradoxical balance—simultaneously concordant and in opposition. The plane has varied terrain, with prairies, mountains, and shallow rivers.\n\nThe Outlands is a great disk. In fact, those who envision the Outer Planes as a wheel point to the Outlands as proof, calling it a microcosm of the planes. That argument might be circular, since the arrangement of the Outlands inspired the idea of the Great Wheel in the first place.\n\nEvenly spaced around the outside edge of the circle are the **gate-towns**: sixteen settlements, each built around a portal leading to one of the Outer Planes. Each gate-town shares many of the characteristics of the plane where its gate leads. Planar emissaries often meet in these gate-towns, so it isn't unusual to see strange interactions, such as a Celestial and a Fiend arguing in a tavern while sharing a fine bottle of wine.\n\n#### Gate-Towns of the Outlands\n\n| Town | Gate Destination |\n|---|---|\n| Automata | Mechanus |\n| Bedlam | Pandemonium |\n| Curst | Carceri |\n| Ecstasy | Elysium |\n| Excelsior | Mount Celestia |\n| Faunel | Beastlands |\n| Fortitude | Arcadia |\n| Glorium | Ysgard |\n| Hopeless | Hades |\n| Plague-Mort | Abyss |\n| Ribcage | Nine Hells |\n| Rigus | Acheron |\n| Sylvania | Arborea |\n| Torch | Gehenna |\n| Tradegate | Bytopia |\n| Xaos | Limbo |\n\n#### Outlands Adventures\n\nThe Outlands is the closest the Outer Planes come to being like a world on the Material Plane. Adventurers can travel easily from one gate-town to the next, making a tremendous variety of planar-themed adventures possible within the boundaries of the Outlands.\n\nAdventures in the Outlands often involve the conflicts between opposing planar influences. It's much easier for a slaad to wreak havoc in the gate-town of Automata than it is for even a horde of slaadi to accomplish anything in Mechanus itself. Celestial spies and Fiend assassins carry out subtle plots and deadly sabotage across the Outlands.\n\nDespite these conflicts, the Outlands remains a plane of balance. Toward the center of the plane, away from the gate-towns, lie vast stretches of land similar to the different environments found on worlds of the Material Plane. Preserving nature's balance from the pull of powerful extremes in any direction can also be a theme of adventures here.\n\n*Planescape: Adventures in the Multiverse* includes extensive information on the Outlands.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
