{
  "name": "Pandemonium",
  "slug": "pandemonium",
  "category": "outer",
  "description": "**Pandemonium** is a plane of overwhelming chaos, a great mass of rock riddled with tunnels carved by howling winds. It is cold, noisy, and dark, with no natural light. Wind quickly extinguishes nonmagical open flames such as torches and campfires. It also makes conversation possible only by yelling, and even then only to a maximum distance of 10 feet. See \"Environmental Effects\" in chapter 3 for more information about the winds of Pandemonium.\n\nMost of the plane's inhabitants are creatures that were banished to the plane with no hope of escape. The incessant winds force them to take shelter in places where the howls of the winds sound like distant cries of torment.\n\n#### Layers of Pandemonium\n\n| Layer | Description |\n|---|---|\n| Pandesmos | Howling winds, dark streams bound for the River Styx, and blowing snow pour through vast, desolate caverns. |\n| Cocytus | Winds blowing through narrower tunnels create a stronger force and louder wails, making this the so-called \"Layer of Lamentation.\" |\n| Phlegethon | Tunnel walls absorb light while water creates intricate rock formations. |\n| Agathion | Sealed-off tunnels are largely inaccessible from elsewhere, making them ideal as vaults for ancient secrets. |\n\n#### Pandemonium Adventures\n\nPandemonium is the plane of last straws. The incessant howling of its winds brings everyone on the plane, sooner or later, to the edge of lashing out in frustration, breaking down in despair, or dissolving into incoherence—and then some event, force, or creature on the plane pushes them over that edge. Simply existing on the plane is exhausting; trying to accomplish even a basic conversation is aggravating.\n\nAn adventure in Pandemonium can be a way to explore what happens to characters on their worst day, when everything goes wrong and the howling wind won't let up. The trick is to convey the frustration that characters are bound to experience there without transferring that frustration to the players.\n\nA jagged spike somewhere in Cocytus, called **Howler's Crag**, is rumored to have a unique magical property: anything yelled from the top of the crag is said to find the ears of its intended recipient—carried on a shrieking, frigid wind—no matter where in the multiverse that person might be.\n\n---",
  "source": {
    "book": "2024 Dungeon Masters Guide",
    "chapter": "Chapter 6",
    "section": "Cosmology"
  }
}
