{
  "name": "Gorgon",
  "slug": "gorgon",
  "size": "Large",
  "type": "Construct",
  "alignment": "Unaligned",
  "ac": "19",
  "initiative": "+0 (10)",
  "hp": "114",
  "hpFormula": "12d10 + 48",
  "speed": "40 ft.",
  "abilityScores": {
    "str": 20,
    "dex": 11,
    "con": 18,
    "int": 10,
    "wis": 10,
    "cha": 10
  },
  "abilitySaves": {
    "str": 5,
    "dex": 0,
    "con": 4,
    "int": 0,
    "wis": 0,
    "cha": 0
  },
  "skills": "Perception +7",
  "immunities": "Exhaustion, Petrified",
  "senses": "Darkvision 60 ft.; Passive Perception 17",
  "languages": "None",
  "cr": "5 (XP 1,800; PB +3)",
  "traits": [],
  "actions": [
    {
      "name": "Gore",
      "description": "*Melee Attack Roll:* +8, reach 5 ft. *Hit:* 18 (2d12 + 5) Piercing damage. If the target is a Large or smaller creature and the gorgon moved 20+ feet straight toward it immediately before the hit, the target has the *Prone* condition."
    },
    {
      "name": "Petrifying Breath (Recharge 5--6)",
      "description": "*Constitution Saving Throw:* DC 15, each creature in a 30-foot Cone. *First Failure:* The target has the *Restrained* condition and repeats the save at the end of its next turn if it is still Restrained, ending the effect on itself on a success. *Second Failure:* The target has the *Petrified* condition instead of the Restrained condition."
    }
  ],
  "bonusActions": [
    {
      "name": "Trample",
      "description": "*Dexterity Saving Throw:* DC 16, one creature within 5 feet that has the Prone condition. *Failure:* 16 (2d10 + 5) Bludgeoning damage. *Success:* Half damage."
    }
  ],
  "reactions": [],
  "legendaryActions": [],
  "lore": "*Bull-like Guardians with Petrifying Breath*\n**Habitat:** Forest, Grassland, Hill; **Treasure:** Any\nResembling mighty bulls armored in iron plates, gorgons are lifelike automatons that seek to destroy all who enter their territories. In addition to goring foes with their deadly horns and trampling them under their iron hooves, gorgons exhale gouts of noxious gas.\nGorgons are created by magic-users to serve as guardians. The process for creating a gorgon is labor intensive and dangerous, with one method requiring the skeleton of a bull, the blood of a medusa and the brain of a basilisk fused into a frame of ensorcelled iron. If the process fails, petrifying gas emerges from the materials, creating a magical threat that can fill a structure and linger for years.\nWhen magic-users create gorgons, they often enchant them to ignore those who confront the creature with a specific command key, usually a password or a specific signal. Once a gorgon is set to guard an area, it attacks any who enter until they flee or are destroyed. Should someone provide the command key, the monster ignores that intruder so long as the intruder remains in its sight. But if the intruder ventures out of sight and then returns without again presenting the command key, the gorgon attacks. Those in a gorgon's territory must remain vigilant and aware of the monster's exact position, or they risk being attacked by a gorgon they thought was no longer a threat.\nThose who create gorgons strive to give them purposefully obscure command keys. Hints at command keys might be found among the records of a gorgon's creator or in the area the gorgon protects--perhaps scrawled as a petrified trespasser's final act. Roll on or choose a result from the Gorgon Command Keys table to inspire the word or signal that temporarily neutralizes a gorgon.\nMost gorgons are iron bulls wreathed in clouds of petrifying gas. Their metal plates vary in sheen and color, from sleek silver to pitted black. The oldest gorgons might be covered in rust, but this rarely impedes their abilities. These gorgons' stomping grounds are littered with the shattered remains of petrified foes. Many gorgons outlive their creators by centuries, misleading some to believe these creations have natural origins and territories. Most such gorgons continue to follow age-old commands, guarding sites long fallen to ruin.\nFollowers of the exiled archdevil Moloch altered the process of creating gorgons to craft their own diabolical guardians called brazen gorgons. These gorgons are hollow, bull-like automatons whose metal bodies glow with intense heat. When they charge their foes, the ribs of their frames open like cages to ensnare enemies and roast them within. Brazen gorgons are often found in blasphemous sites dedicated to Moloch, other archdevils, or bloodthirsty gods.\n> *A gorgon petrifies victims with its deadly breath, then tramples them to pieces.*\n> *Notable among my eccentric ancestor's scattered designs was a schematic of a swamp-dwelling bovine monster and an ominous note: \"Do better.\"*\n>\n> --Lum the Maestro, *A Mind of Metal*",
  "habitat": "Forest, Grassland, Hill",
  "treasure": "Any",
  "source": {
    "book": "2025 Monster Manual",
    "section": "Monstrosities",
    "file": "Monstrosities.md"
  }
}
