{
  "name": "Ancient Red Dragon",
  "slug": "ancient-red-dragon",
  "size": "Gargantuan",
  "type": "Dragon",
  "alignment": "Chaotic Evil",
  "ac": "22",
  "initiative": "+14 (24)",
  "hp": "507",
  "hpFormula": "26d20 + 234",
  "speed": "40 ft., Climb 40 ft., Fly 80 ft.",
  "abilityScores": {
    "str": 30,
    "dex": 10,
    "con": 29,
    "int": 10,
    "wis": 10,
    "cha": 10
  },
  "abilitySaves": {
    "str": 10,
    "dex": 7,
    "con": 9,
    "int": 0,
    "wis": 0,
    "cha": 0
  },
  "skills": "Perception +16, Stealth +7",
  "immunities": "Fire",
  "senses": "Blindsight 60 ft., Darkvision 120 ft.; Passive Perception 26",
  "languages": "Common, Draconic",
  "cr": "24 (XP 62,000, or 75,000 in lair; PB +7)",
  "traits": [
    {
      "name": "Legendary Resistance (4/Day, or 5/Day in Lair)",
      "description": "If the dragon fails a saving throw, it can choose to succeed instead."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "description": "The dragon makes three Rend attacks. It can replace one attack with a use of Spellcasting to cast *Scorching Ray* (level 3 version)."
    },
    {
      "name": "Rend",
      "description": "*Melee Attack Roll:* +17, reach 15 ft. *Hit:* 19 (2d8 + 10) Slashing damage plus 10 (3d6) Fire damage."
    },
    {
      "name": "Fire Breath (Recharge 5-6)",
      "description": "*Dexterity Saving Throw:* DC 24, each creature in a 90-foot Cone. *Failure:* 91 (26d6) Fire damage. *Success:* Half damage."
    },
    {
      "name": "Spellcasting",
      "description": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 23, +15 to hit with spell attacks):"
    }
  ],
  "bonusActions": [],
  "reactions": [],
  "legendaryActions": [
    {
      "name": "Commanding Presence",
      "description": "The dragon uses Spellcasting to cast *Command* (level 2 version). The dragon can't take this action again until the start of its next turn."
    },
    {
      "name": "Fiery Rays",
      "description": "The dragon uses Spellcasting to cast *Scorching Ray* (level 3 version). The dragon can't take this action again until the start of its next turn."
    },
    {
      "name": "Pounce",
      "description": "The dragon moves up to half its Speed, and it makes one Rend attack."
    }
  ],
  "lore": "*Dragon of Greed and Devastation*\n**Habitat:** Hill, Mountain; **Treasure:** Any\nRed dragons take whatever they desire and burn to ash anything that stands in their way. These chromatic dragons endlessly desire more -- more magic, territory, treasure, or whatever else inflames their cruel ambitions.\nRed dragons make their lairs amid perilous cliffs and volcanoes. Within, they amass and fiercely protect hoards of treasure, and many have perfect recall of the hoards' contents and the locations of all they've collected. Should anything go missing, red dragons fly into rages. They don't rest until their treasures are returned and the thieves have burned.\nRed dragons believe themselves to be the greatest of all dragons and, by extension, the greatest of all creatures. To them, pillaging and conquering are their right -- treasures can find no more honored place than in their hoards, and other creatures are privileged to serve them.\nRed dragon wyrmlings are born destroyers. From a young age, they delight in igniting objects and creatures alike. They sometimes restrain themselves from scorching creatures to instead bully others into following their orders and bringing them gifts.\nYoung red dragons number among the most unpredictable of their kind. They seek territories rich with treasures and potential followers, raiding, burning, and slaughtering to enforce their will. Unless these dragons meet significant resistance, they cement their power and begin reigns of terror that can last for centuries.\nAdult red dragons are tyrants that claim vast domains and might command armies of followers or significant magical resources. Red dragons rarely pay attention to the nations and claims of smaller creatures, and they might consider entire cities part of their realm. Most red dragons are inattentive rulers, though, spending decades focused on their own comforts, hoards, or magical concerns within their lairs. But when their attention returns to their territories, if they find matters not to their liking, whole lands might burn.\nAncient red dragons number among the most feared and destructive beings in the multiverse. Few can withstand the wrath of an ancient red dragon that turns its mind toward devastation. These dragons' greed matches their ruinous potential, and they collect vast hoards studded with storied treasures and magic items. Their lairs frequently tap into volcanic depths and might pierce other planes of existence, bringing servants from the Elemental Plane of Fire or the Lower Planes into their service.\nRed dragons make their lairs in smoldering, unapproachable places such as volcanic mountains, burning wastelands, and ruins they've stolen from other creatures.\nThe region containing an adult or ancient red dragon's lair is warped by its presence, creating the following effects:\n**Burning Heat.** The area within 1 mile of the lair is an area of extreme heat. A burning creature or object takes an additional 1d4 Fire damage at the start of each of its turns.\n**Smoldering Haze.** The area within 1 mile of the lair is Lightly Obscured with clouds of ash. Whenever a creature other than the dragon or one of its allies finishes a Long Rest in that area, that creature must succeed on a DC 15 Constitution saving throw or have the Poisoned condition for 1 hour.\nIf the dragon dies or moves its lair elsewhere, these effects end immediately.",
  "habitat": "Hill, Mountain",
  "treasure": "Any",
  "source": {
    "book": "2025 Monster Manual",
    "section": "Dragons-Chromatic",
    "file": "Dragons-Chromatic.md"
  }
}
