{
  "name": "Death Knight Aspirant",
  "slug": "death-knight-aspirant",
  "size": "Medium or Small",
  "type": "Undead",
  "alignment": "Chaotic Evil",
  "ac": "20",
  "initiative": "+4 (14)",
  "hp": "178",
  "hpFormula": "21d8 + 84",
  "speed": "30 ft.",
  "abilityScores": {
    "str": 20,
    "dex": 10,
    "con": 18,
    "int": 10,
    "wis": 10,
    "cha": 10
  },
  "abilitySaves": {
    "str": 5,
    "dex": 4,
    "con": 4,
    "int": 0,
    "wis": 0,
    "cha": 0
  },
  "immunities": "Necrotic, Poison; Exhaustion, Frightened, Poisoned",
  "senses": "Darkvision 120 ft.; Passive Perception 11",
  "languages": "Abyssal, Common",
  "cr": "11 (XP 7,200; PB +4)",
  "traits": [
    {
      "name": "Magic Resistance",
      "description": "The aspirant has Advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Marshal Undead",
      "description": "Undead creatures of the aspirant's choice (excluding itself) in a 60-foot *Emanation* originating from it have Advantage on attack rolls and saving throws. It can't use this trait if it has the *Incapacitated* condition."
    }
  ],
  "actions": [
    {
      "name": "Multiattack",
      "description": "The aspirant makes three Dread Blade attacks."
    },
    {
      "name": "Dread Blade",
      "description": "*Melee Attack Roll:* +9, reach 5 ft. *Hit:* 14 (2d8 + 5) Slashing damage plus 10 (3d6) Necrotic damage."
    },
    {
      "name": "Hellfire Orb (Recharge 5--6)",
      "description": "*Dexterity Saving Throw:* DC 15, each creature in a 20-foot-radius *Sphere* centered on a point the aspirant can see within 120 feet of itself. *Failure:* 21 (6d6) Fire damage plus 21 (6d6) Necrotic damage. *Success:* Half damage."
    },
    {
      "name": "Spellcasting",
      "description": "The aspirant casts one of the following spells, using Charisma as the spellcasting ability (spell save DC 15):"
    }
  ],
  "bonusActions": [],
  "reactions": [
    {
      "name": "Parry",
      "description": "*Trigger:* The aspirant is hit by a melee attack roll while holding a weapon. *Response:* The aspirant adds 4 to its AC against that attack, possibly causing it to miss."
    }
  ],
  "legendaryActions": [],
  "lore": "*Haunted Commanders of Unliving Legions*\n**Habitat:** Any; **Treasure:** Armaments\nChampions of evil, death knights are armor-clad, skeletal warlords. Combining devastating martial prowess and blasphemous magic, these undying tyrants lead unholy legions against the living or brood in cursed citadels. Every death knight is haunted by a legacy of tragedy and dishonor that drives it to commit greater evils.\nDeath knights are deadly combatants and domineering commanders with grim histories. Some strive to end the curses that doom them to undeath, though their selfish souls eternally shackle them to their fates. Others, like the infamous death knight Lord Soth, brood in dismal ruins for centuries, rousing themselves to action only when something reignites their deathless evil.\nWhen the leader of a villainous order rises as a death knight, their wicked devotees might join them in their cursed existence as death knight aspirants. These followers bear a measure of their leader's power and serve as they did in life, obediently following the death knight's decrees and heralding its terrible will.",
  "habitat": "Any",
  "treasure": "Armaments",
  "source": {
    "book": "2025 Monster Manual",
    "section": "Undead",
    "file": "Undead.md"
  }
}
