{
  "1-4": [
    "A dragon wyrmling has gathered a band of kobolds to help it amass a hoard.",
    "Wererats living in a city's sewers plot to take control of the governing council.",
    "Bandit activity signals efforts to revive an evil cult long ago driven from the region.",
    "A pack of gnolls is rampaging dangerously close to local farmlands.",
    "A rivalry between two merchant families escalates from mischief to mayhem.",
    "A new sinkhole has revealed a long-buried dungeon thought to hold treasure.",
    "Miners discovered an underground ruin and were captured by monsters living there.",
    "An innocent person is being framed for the crimes of a shape-shifting monster.",
    "Ghouls are venturing out of the catacombs at night.",
    "A notorious criminal hides from the law in an old ruin or abandoned mine.",
    "A contagion in a forest is causing spiders to grow massive and become aggressive.",
    "To take revenge against a village for an imagined slight, a necromancer has been animating the corpses in the village cemetery.",
    "An evil cult is spreading in a village. Those who oppose the cult are marked for sacrifice.",
    "An abandoned house on the edge of town is haunted by Undead because of a cursed item in the house.",
    "Creatures from the Feywild enter the world and cause mischief and misfortune among villagers and their livestock.",
    "A hag's curse is making animals unusually aggressive.",
    "Bullies have appointed themselves the village militia and are extorting money and food from villagers.",
    "After a local fisher pulls a grotesque statue from the sea, aquatic monsters start attacking the waterfront at night.",
    "The ruins on the hill near the village lie under a curse, so people don't go there—except a scholar who wants to study the ruins.",
    "A new captain has taken charge of a band of pirates or bandits and started raiding more frequently."
  ],
  "5-10": [
    "A group of cultists has summoned a demon to wreak havoc in the city.",
    "A rebel lures monsters to the cause with the promise of looting the king's treasury.",
    "An evil Artifact has transformed a forest into a dismal swamp full of horrific monsters.",
    "An Aberration living in the Underdark sends minions to capture people from the surface to turn those people into new minions.",
    "A monster (perhaps a devil, slaad, or hag) is impersonating a prominent noble to throw the realm into civil war.",
    "A master thief plans to steal royal regalia.",
    "A golem intended to serve as a protector has gone berserk and captured its creator.",
    "A conspiracy of spies, assassins, and necromancers schemes to overthrow a ruler.",
    "After establishing a lair, a young dragon is trying to earn the fear and respect of other creatures living nearby.",
    "The approach of a lone giant alarms the people of a town, but the giant is simply looking for a place to live in peace.",
    "An enormous monster on display in a menagerie breaks free and goes on a rampage.",
    "A coven of hags steals cherished memories from travelers.",
    "A villain seeks powerful magic in an ancient ruin, hoping to use it to conquer the region.",
    "A scheming aristocrat hosts a masquerade ball, which many guests see as an opportunity to advance their own agendas.",
    "A ship carrying a valuable treasure or an evil Artifact sinks in a storm or monster attack.",
    "A natural disaster was actually caused by magic gone awry or a cult's villainous plans.",
    "A secretive cult uses spies to heighten tensions between two rival nations, hoping to provoke a war.",
    "Rebels or forces of an enemy nation have kidnapped an important noble.",
    "The descendants of a displaced people want to reclaim their ancestral city, which is now inhabited by monsters.",
    "A renowned group of adventurers never returned from an expedition to a famous ruin."
  ],
  "11-16": [
    "A portal to the Abyss opens in a cursed location and spews demons into the world.",
    "A band of hunting giants has driven its prey—enormous beasts—into pastureland.",
    "An adult dragon's lair is transforming an expanse into an environment inhospitable to the other creatures living there.",
    "A long-lost journal describes an incredible journey to a hidden subterranean realm full of magical wonders.",
    "Cultists hope to persuade a dragon to undergo the rite that will transform it into a dracolich.",
    "The ruler of the realm is sending an emissary to a hostile neighbor to negotiate a truce, and the emissary needs protection.",
    "A castle or city has been drawn into another plane of existence.",
    "A storm tears across the land, with a mysterious flying citadel in the eye of the storm.",
    "Two parts of a magic item are in the hands of bitter enemies; the third piece is lost.",
    "Evil cultists gather from around the world to summon a monstrous god or alien entity.",
    "A tyrannical ruler outlaws the use of magic without official sanction. A secret society of spellcasters seeks to oust the tyrant.",
    "During a drought, low water levels in a lake reveal previously unknown ancient ruins that contain a powerful evil."
  ],
  "17-20": [
    "An ancient dragon is scheming to destroy a god and take the god's place in the pantheon.",
    "A band of giants drove away a metallic dragon and took over the dragon's lair.",
    "An ancient hero returns from the dead to prepare the world for the return of an equally ancient monster.",
    "An ancient Artifact has the power to defeat or imprison a rampaging titan.",
    "A god of agriculture is angry, causing rivers to dry up and crops to wither.",
    "An Artifact belonging to a god falls into mortal hands.",
    "A titan imprisoned in the Underdark begins to break free, causing terrible earthquakes.",
    "A lich tries to exterminate any spellcasters that approach the lich's level of power.",
    "A holy temple was built around a portal leading to one of the Lower Planes to prevent evil from passing through.",
    "A primordial force of nature awakens and threatens to consume entire continents."
  ]
}
