{
  "name": "Young Blue Dragon",
  "slug": "young-blue-dragon",
  "size": "Large",
  "type": "Dragon",
  "alignment": "Lawful Evil",
  "ac": "18",
  "initiative": "+4 (14)",
  "hp": "152",
  "hpFormula": "16d10 + 64",
  "speed": "40 ft., Burrow 20 ft., Fly 80 ft.",
  "abilityScores": {
    "str": 21,
    "dex": 10,
    "con": 19,
    "int": 10,
    "wis": 10,
    "cha": 10
  },
  "abilitySaves": {
    "str": 5,
    "dex": 4,
    "con": 4,
    "int": 0,
    "wis": 0,
    "cha": 0
  },
  "skills": "Perception +9, Stealth +4",
  "immunities": "Lightning",
  "senses": "Blindsight 30 ft., Darkvision 120 ft.; Passive Perception 19",
  "languages": "Common, Draconic",
  "cr": "9 (XP 5,000; PB +4)",
  "traits": [],
  "actions": [
    {
      "name": "Multiattack",
      "description": "The dragon makes three Rend attacks."
    },
    {
      "name": "Rend",
      "description": "*Melee Attack Roll:* +9, reach 10 ft. *Hit:* 12 (2d6 + 5) Slashing damage plus 5 (1d10) Lightning damage."
    },
    {
      "name": "Lightning Breath (Recharge 5-6)",
      "description": "*Dexterity Saving Throw:* DC 16, each creature in a 60-foot-long, 5-foot-wide Line. *Failure:* 55 (10d10) Lightning damage. *Success:* Half damage."
    }
  ],
  "bonusActions": [],
  "reactions": [],
  "legendaryActions": [],
  "lore": "*Dragon of Tyranny and Tempests*\n**Habitat:** Coastal, Desert; **Treasure:** Relics\nArrogant and imperious, blue dragons are chromatic dragons that crave control and collect followers like other dragons hoard treasure. They seek to transform their territories into empires, domains to be feared by nations.\nBlue dragons have sharp features with piercing horns and scales that range from sapphire to the shades of stormy skies. They dwell in deserts and badlands, particularly regions with dramatic spires from whose tops they might see for miles. They seek lairs near sites of symbolic power, such as the abandoned fortresses of giants, the colossi of fallen empires, or monuments raised by their followers.\nRegalia of rulership and artistic masterpieces fill blue dragons' hoards. These dragons have no interest in treasures that are common or flawed, preferring one-of-a-kind gemstones, the crowns of fallen royals, and magic items capable of spreading the dragons' influence.\nBlue dragon wyrmlings often serve other powerful creatures, learning the ways of control and establishing fearful reputations among weaker creatures. Many wyrmlings initially serve loyally, but as their powers grow to match their ambitions, they eventually betray or abandon their associates. These wyrmlings tempt small groups of creatures into their service, rewarding them with modest treasures and promises of future power.\nYoung blue dragons seek to establish themselves as forces to be feared. Many claim isolated communities to rule over or ancient ruins where they might find magical paths to power. These blue dragons might temporarily cooperate with other dragons or powerful villains to gain followers and influence.\nAdult blue dragons command small empires, which might be territories of subjugated followers, shadowy criminal networks, or cultic enclaves. Endlessly suspicious and wary of rivals, these dragons enact elaborate schemes to ruin their foes, test the loyalty of their servants, and ensure their dominance for centuries.\nAncient blue dragons think beyond dominating groups of short-lived servants. Instead, they seek to claim their places above other dragons and their world's most powerful inhabitants. If world domination seems too tedious or cliche, these dragons might seek to seize control of extraplanar realms, multiworld empires, or forces of reality -- like life, storms, or time itself.\nBlue dragons dwell in arid lands. Their lairs might be death traps meant to entomb invaders or ostentatious fortresses where they plot domination.\nThe region containing an adult or ancient blue dragon's lair is changed by its presence, creating the following effects:\n**Sinkholes.** Sinkholes form more frequently in the area within 1 mile of the lair. Whenever a creature in that area other than the dragon and its allies finishes a Long Rest, roll 1d20. On a 1, a sinkhole opens beneath the creature, and the creature must succeed on a DC 15 Dexterity saving throw or fall 2d4 x 10 feet into the sinkhole.\n**Spiteful Storms.** Dust devils and thunderstorms rage within 1 mile of the lair. The area is Lightly Obscured.\nIf the dragon dies or moves its lair elsewhere, these effects end immediately.",
  "habitat": "Coastal, Desert",
  "treasure": "Relics",
  "source": {
    "book": "2025 Monster Manual",
    "section": "Dragons-Chromatic",
    "file": "Dragons-Chromatic.md"
  }
}
