{
  "name": "Scrying",
  "level": 5,
  "school": "Divination",
  "classes": ["Bard", "Cleric", "Druid", "Warlock", "Wizard"],
  "ritual": false,
  "castingTime": {
    "type": "Time",
    "timeAmount": 10,
    "timeUnit": "minutes",
    "ritual": false
  },
  "range": {
    "type": "Self"
  },
  "components": {
    "verbal": true,
    "somatic": true,
    "material": {
      "description": "a focus worth 1,000+ GP, such as a crystal ball, mirror, or water-filled font",
      "cost": 1000,
      "currency": "GP",
      "consumed": false
    }
  },
  "duration": {
    "type": "Timed",
    "concentration": true,
    "amount": 10,
    "unit": "minutes"
  },
  "description": "You can see and hear a creature you choose that is on the same plane of existence as you. The target makes a Wisdom saving throw, which is modified by how well you know the target and the sort of physical connection you have to it. The target doesn't know what it is making the save against, only that it feels uneasy.\n\nKnowledge modifiers: Secondhand (heard of the target) +5, Firsthand (met the target) +0, Extensive (know the target well) -5.\n\nPhysical connection modifiers: Picture or other likeness -2, Garment or other possession -4, Body part, lock of hair, or bit of nail -10.\n\nOn a successful save, the target isn't affected, and you can't use this spell on it again for 24 hours.\n\nOn a failed save, the spell creates an Invisible, intangible sensor within 10 feet of the target. You can see and hear through the sensor as if you were there. The sensor moves with the target, remaining within 10 feet of it for the duration. If something can see the sensor, it appears as a luminous orb about the size of your fist.\n\nInstead of targeting a creature, you can target a location you have seen. When you do so, the sensor appears at that location and doesn't move.",
  "targetType": "special",
  "mustSeeTarget": false,
  "savingThrow": {
    "ability": "Wisdom",
    "noEffectOnSuccess": true,
    "effectOnFailure": "The spell creates an Invisible, intangible sensor within 10 feet of the target through which the caster can see and hear. The sensor moves with the target for the duration.",
    "effectOnSuccess": "The target isn't affected, and you can't use this spell on it again for 24 hours."
  },
  "tags": ["scrying", "sensor", "surveillance", "divination", "remote-viewing"]
}
