{
  "name": "Actions",
  "slug": "actions",
  "description": "| Action | Summary |\n|---|---|\n| Attack | Attack with a weapon or Unarmed Strike |\n| Dash | For the rest of the turn, give yourself extra movement equal to your Speed |\n| Disengage | Your movement doesn't provoke Opportunity Attacks for the rest of the turn |\n| Dodge | Until the start of your next turn, attack rolls against you have Disadvantage, and you make Dexterity saving throws with Advantage. You lose this benefit if you have the Incapacitated condition or if your Speed is 0 |\n| Help | Help another creature's ability check or attack roll, or administer First Aid |\n| Hide | Make a Dexterity (Stealth) check |\n| Influence | Make a Charisma (Deception, Intimidation, Performance, or Persuasion) or Wisdom (Animal Handling) check to alter a creature's attitude |\n| Magic | Cast a spell, use a magic item, or use a magical feature |\n| Ready | Prepare to take an action in response to a trigger you define |\n| Search | Make a Wisdom (Insight, Medicine, Perception, or Survival) check |\n| Study | Make an Intelligence (Arcana, History, Investigation, Nature, or Religion) check |\n| Utilize | Use a nonmagical object |\n**Advantage.** If you have Advantage on a D20 Test, roll two d20s and use the higher roll. A roll can't benefit from more than one source of Advantage, and Advantage and Disadvantage on the same roll cancel each other, regardless of the number of each.\n**Adventure.** An adventure is a series of connected encounters that form a cohesive story.\n**Alignment.** A creature's alignment broadly describes its ethical attitudes and ideals. Alignment is a combination of two factors: one identifies morality (Good, Evil, or Neutral), and the other describes attitudes toward society and order (Lawful, Chaotic, or Neutral). These factors create nine possible alignments.\n**Area of Effect.** Areas of effect define the areas where spells and other features take effect. The shapes are defined here:\n- **Cone.** A Cone extends in a direction you choose from its point of origin. A Cone's width at a given point along its length is equal to that point's distance from the point of origin. A Cone's point of origin isn't included in the Cone's area of effect unless you decide otherwise.\n- **Cube.** You select a Cube's point of origin, which lies anywhere on a face of the Cube. The Cube's size expresses the length of each side. A Cube's point of origin isn't included in the Cube's area of effect unless you decide otherwise.\n- **Cylinder.** A Cylinder's point of origin is the center of either the top or bottom of the Cylinder. The Cylinder's size expresses the radius and height. A Cylinder's point of origin is included in the Cylinder's area of effect.\n- **Emanation.** An Emanation originates from a creature or a point in space, extending outward in all directions. The Emanation's size expresses the distance it extends. An Emanation's point of origin (creature or point) is included in the Emanation's area of effect.\n- **Line.** A Line extends from its point of origin in a straight path along its length and covers an area defined by its width. A Line's point of origin isn't included in the Line's area of effect unless you decide otherwise.\n- **Sphere.** You select a Sphere's point of origin, and the Sphere extends outward from that point. The Sphere's size expresses the radius. A Sphere's point of origin is included in the Sphere's area of effect.\n**Armor Class (AC).** An Armor Class is the target number for an attack roll. AC represents how difficult it is to hit a target. Armor, shields, spells, and other factors can grant a bonus to AC or set AC to a specific number.\n**Armor Training.** If you wear armor without having training with it, you have Disadvantage on any D20 Test that uses Strength or Dexterity, and you can't cast spells.\n**Attack Roll.** An attack roll is a D20 Test that represents making an attack. Attack rolls are made against a target's AC.\n**Attitude.** A monster has a starting attitude toward a player character: Friendly, Hostile, or Indifferent.\n**Attunement.** Some magic items require a creature to form a bond — called Attunement — with them before the creature can use the item's magical properties. A creature can be attuned to no more than three magic items at a time. Attuning to an item requires a Short Rest focused on only that item while in physical contact with it. An item can be attuned to only one creature at a time.\n**Blindsight.** If you have Blindsight, you can see within a specific range without relying on physical sight. Within that range, you can see anything that isn't behind Total Cover, even if you have the Blinded condition or are in Darkness. Moreover, in that range you can see something that has the Invisible condition.\n**Bloodied.** A creature is Bloodied while it has half its Hit Points or fewer remaining.\n**Bonus Action.** On your turn, you can take one Bonus Action if a spell, feature, or other rule allows it. You choose when to take a Bonus Action during your turn unless the Bonus Action's timing is specified.\n**Breaking Objects.** When you take the Attack action, you can use your attack to try to destroy an object.",
  "category": "Rule",
  "source": {
    "book": "2024 Players Handbook",
    "chapter": "Appendix C",
    "section": "Rules Glossary"
  }
}
