{
  "name": "Areas of Knowledge (Study Action)",
  "slug": "areas-of-knowledge-study-action",
  "description": "| Skill | Areas |\n|---|---|\n| Arcana | Spells, magic items, eldritch symbols, magical traditions, planes of existence, certain creatures (Aberrations, Constructs, Elementals, Fey, Monstrosities) |\n| History | Historic events and people, ancient civilizations, wars, legends, cultural customs |\n| Investigation | Traps, ciphers, riddles, gadgetry |\n| Nature | Terrain, plants, animals, weather, natural cycles, certain creatures (Beasts, Dragons, Oozes, Plants) |\n| Religion | Deities, holy symbols, sacred rites, religious hierarchies, certain creatures (Celestials, Fiends, Undead) |\n**Session.** A session is a single meeting of the D&D group.\n**Short Rest.** A Short Rest is a 1-hour period of downtime, during which a character does nothing more strenuous than eating, drinking, reading, and tending to wounds. During a Short Rest, a character can spend Hit Dice to regain Hit Points. Roll each spent Hit Die and add the character's Constitution modifier to determine the Hit Points regained.\n**Size.** A creature belongs to a size category: Tiny, Small, Medium, Large, Huge, or Gargantuan.\n| Size | Space |\n|---|---|\n| Tiny | 2.5 by 2.5 ft. |\n| Small | 5 by 5 ft. |\n| Medium | 5 by 5 ft. |\n| Large | 10 by 10 ft. |\n| Huge | 15 by 15 ft. |\n| Gargantuan | 20 by 20 ft. or larger |\n**Skill.** A skill represents a specific aspect of an ability score that a character can be proficient in:\n- **Strength:** Athletics\n- **Dexterity:** Acrobatics, Sleight of Hand, Stealth\n- **Intelligence:** Arcana, History, Investigation, Nature, Religion\n- **Wisdom:** Animal Handling, Insight, Medicine, Perception, Survival\n- **Charisma:** Deception, Intimidation, Performance, Persuasion\n**Speed.** Every creature has a Speed, which is the distance in feet that the creature can walk in 1 turn. Special movement types: Climb Speed, Fly Speed, Swim Speed, and Burrow Speed.\n**Spell Attack.** A spell attack is a special attack: d20 + spellcasting ability modifier + Proficiency Bonus against the target's AC.\n**Spell Save DC.** Spell save DC = 8 + spellcasting ability modifier + Proficiency Bonus.\n**Spell Slot.** A spell slot represents a character's capacity to cast a spell. Casting a spell of level 1 or higher expends a slot of the spell's level or higher. You regain all expended spell slots when you finish a Long Rest.\n**Spellcasting Focus.** A Spellcasting Focus is a special item — such as a crystal, wand, or holy symbol — that you can use in place of any Material component that lacks a cost and that isn't consumed.\n**Stable.** A creature is Stable if it has 0 Hit Points but isn't required to make Death Saving Throws.\n**Suffocation.** A creature can hold its breath for a number of minutes equal to 1 + its Constitution modifier (minimum of 30 seconds). When a creature runs out of breath or is choking, it can survive for a number of rounds equal to its Constitution modifier (minimum of 1 round). At the start of its next turn, it drops to 0 HP and is dying, and it can't regain HP or be stabilized until it can breathe again.\n**Surprise.** If combat starts and a combatant is surprised, that combatant can't move or take actions (including Bonus Actions and Reactions) on its first turn in combat, and can't take a Reaction until that turn ends.\n**Swimming.** While swimming, each foot of movement costs 1 extra foot (2 extra feet in Difficult Terrain) unless a creature has a Swim Speed.\n**Telepathy.** Telepathy is a magical ability that allows a creature to communicate mentally with another creature within a specified range. The contacted creature doesn't need to share a language with the telepath, but the contacted creature must understand at least one language.\n**Temporary Hit Points.** Temporary Hit Points are a buffer against damage. When you take damage, Temporary HP are lost first. They can't be restored by healing, and they don't stack (you keep the higher amount). They go away after a Long Rest.\n**Tremorsense.** A creature with Tremorsense can pinpoint the location of creatures and moving objects within a specific range, provided that the creature with Tremorsense and anything it's detecting are both in contact with the same surface or the same liquid.\n**Truesight.** If you have Truesight, your vision is enhanced within a specified range. In that range, your vision pierces through Darkness (including magical Darkness), Illusions, invisibility, and transmutations. You also see into the Ethereal Plane within that range.\n**Turn.** During a round, each participant takes a turn. On your turn, you can move a distance up to your Speed and take one action.\n**Unarmed Strike.** An Unarmed Strike is a melee attack that involves using your body to damage, shove, or grapple. Whenever you use your Unarmed Strike, choose one of the following options:\n- **Damage.** You make an attack roll against the target. Your bonus to hit equals your Strength modifier + your Proficiency Bonus. On a hit, the target takes Bludgeoning damage equal to 1 + your Strength modifier.\n- **Grapple.** The target must succeed on a Strength or Dexterity saving throw (its choice), or it has the Grappled condition. The DC equals 8 + your Strength modifier + your Proficiency Bonus. You need a free hand for the grapple.\n- **Shove.** The target must succeed on a Strength or Dexterity saving throw (its choice), or you either push the target 5 feet away or cause it to have the Prone condition. The DC equals 8 + your Strength modifier + your Proficiency Bonus.\n**Vulnerability.** If you have Vulnerability to a damage type, damage of that type is doubled against you. Vulnerability is applied after all other modifiers to damage.\n**Weapon Attack.** A weapon attack is an attack made with a weapon — a melee weapon attack or ranged weapon attack. Bonus to hit: ability modifier (Strength for melee, Dexterity for ranged, or as specified by a weapon property like Finesse) + Proficiency Bonus (if proficient with the weapon).",
  "category": "Rule",
  "source": {
    "book": "2024 Players Handbook",
    "chapter": "Appendix C",
    "section": "Rules Glossary"
  }
}
