{
  "name": "Modify Memory",
  "level": 5,
  "school": "Enchantment",
  "classes": ["Bard", "Wizard"],
  "ritual": false,
  "castingTime": {
    "type": "Action",
    "ritual": false
  },
  "range": {
    "type": "Ranged",
    "distance": 30,
    "unit": "feet"
  },
  "components": {
    "verbal": true,
    "somatic": true
  },
  "duration": {
    "type": "Timed",
    "concentration": true,
    "amount": 1,
    "unit": "minutes"
  },
  "description": "You attempt to reshape another creature's memories. One creature that you can see within range makes a Wisdom saving throw. If you are fighting the creature, it has Advantage on the save. On a failed save, the target has the Charmed condition for the duration. While Charmed in this way, the target also has the Incapacitated condition and is unaware of its surroundings, though it can still hear you. If it takes any damage or is targeted by another spell, this spell ends, and no memories are modified.\n\nWhile the Charmed condition lasts, you can affect the target's memory of an event that it experienced within the last 24 hours and that lasted no more than 10 minutes. You can permanently eliminate all memory of the event, allow the target to recall the event with perfect clarity, change its memory of the event's details, or create a memory of some other event.\n\nYou must speak to the target to describe how its memories are affected, and it must be able to understand your language for the modified memories to take root. Its mind fills in any gaps in the details of your description. If the spell ends before you finish describing the modified memories, the creature's memory isn't altered. Otherwise, the modified memories take hold when the spell ends.\n\nA modified memory doesn't necessarily affect how a creature behaves, particularly if the memory contradicts the creature's natural inclinations, alignment, or beliefs. An illogical modified memory is dismissed as a bad dream or a hallucination. The DM might deem a modified memory too nonsensical to affect a creature.\n\nA Remove Curse or Greater Restoration spell cast on the target restores the creature's true memory.",
  "targetCount": 1,
  "targetType": "creature",
  "mustSeeTarget": true,
  "savingThrow": {
    "ability": "Wisdom",
    "noEffectOnSuccess": true,
    "effectOnFailure": "Target has the Charmed and Incapacitated conditions for the duration. While Charmed, caster can modify one memory of an event within the last 24 hours lasting no more than 10 minutes.",
    "advantageCondition": "If you are fighting the creature"
  },
  "conditionsApplied": [
    {
      "condition": "Charmed",
      "trigger": "onFailedSave",
      "duration": "For the spell's duration"
    },
    {
      "condition": "Incapacitated",
      "trigger": "onFailedSave",
      "duration": "For the spell's duration, while Charmed"
    }
  ],
  "higherLevelCasting": {
    "overrides": [
      {
        "minSlotLevel": 6,
        "maxSlotLevel": 6,
        "description": "You can alter the target's memories of an event that took place up to 7 days ago."
      },
      {
        "minSlotLevel": 7,
        "maxSlotLevel": 7,
        "description": "You can alter the target's memories of an event that took place up to 30 days ago."
      },
      {
        "minSlotLevel": 8,
        "maxSlotLevel": 8,
        "description": "You can alter the target's memories of an event that took place up to 365 days ago."
      },
      {
        "minSlotLevel": 9,
        "maxSlotLevel": 9,
        "description": "You can alter the target's memories of an event that took place any time in the creature's past."
      }
    ]
  },
  "tags": ["control", "memory", "charm"]
}
